#language: ru
@002
@002.002

Функционал: [002. Кредиты][002. Кредитная заявка через сайт]

  @002.002.001
  Сценарий: 001. Действующий клиент. Короткая анкета. Выдача.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * подождать 10 секунд
    * выполнить сценарий "Кредитная заявка -> Удаление всех кредитных заявок клиента"
    * выполнить сценарий "КЗ через сайт. Короткая анкета -> Приём заявки"
    * выполнить сценарий "Кредитная заявка через сайт -> Идентификация клиента" с параметрами:
      | Параметр                | Значение                |
      | Начальный статус заявки | Предварительное решение |
    * выполнить сценарий "Кредитная заявка через сайт -> Ввод заявки"
    * выполнить сценарий "Кредитная заявка через сайт -> Анализ и принятие решения"
    * выполнить сценарий "КЗ через сайт. Короткая анкета -> Сверка"
    * выполнить сценарий "КЗ через сайт. Короткая анкета -> Выдача кредита"

  @002.002.002
  Сценарий: 002. Действующий клиент. Полная анкета. Выдача.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * подождать 20 секунд
    * выполнить сценарий "Кредитная заявка -> Удаление всех кредитных заявок клиента"
    * выполнить сценарий "КЗ через сайт. Полная анкета -> Приём заявки"
    * выполнить сценарий "Кредитная заявка через сайт -> Идентификация клиента" с параметрами:
      | Параметр                | Значение                   |
      | Начальный статус заявки | Ожидание клиента на сделку |
    * выполнить сценарий "КЗ через сайт. Полная анкета -> Сверка"
    * выполнить сценарий "КЗ через сайт. Полная анкета -> Выдача кредита"
