#language: ru
Функционал: Настройки

  Сценарий: Изменить значение настройки
    * через "Главное меню" перейти на страницу "Настройки"
    * в списке "Настройки" выбрать "${Настройки}"
    * дождаться отображения страницы "Список настроек"
    * ввести в поле "Название" значение "${Настройка}"
    * нажать на кнопку "Показать"
    * в таблице "Список настроек" найти строку, соответствующую условиям:
      | Столбец            | Значение     |
      | НАЗВАНИЕ НАСТРОЙКИ | ${Настройка} |
    * в найденной строке нажать на "НАЗВАНИЕ НАСТРОЙКИ"
    * дождаться отображения страницы "Создание настройки"
    * ввести в поле "Значение" значение "${Новое значение}" и проконтролировать
    * нажать на кнопку "Сохранить"

