#language: ru
Функционал: Настройки

  Сценарий: Изменить значение настройки
    * через "Главное меню" перейти на страницу "Настройки"
    * в списке "Настройки" выбрать "${Настройки}"
    * дождаться отображения страницы "Список настроек"
    * ввести в поле "Название" значение "${Настройка}"
    * нажать на кнопку "Показать"
    * в списке "Список настроек" выбрать "${Настройка}"
    * дождаться отображения страницы "Создание настройки"
    * ввести в поле "Значение" значение "${Новое значение}" и проконтролировать
    * нажать на кнопку "Сохранить"

