#language: ru
Функционал: Фрагменты

  Сценарий: Войти в ЕФР
    * открыть браузер
    * перейти по ссылке "${Адрес стартовой страницы}"
    * дождаться отображения страницы "Вход в ЕФР"
    * заполнить поля формы значениями:
      | Тип  | Название         | Значение                  |
      | поле | Имя пользователя | ${Пользователь} -> логин  |
      | поле | Пароль           | ${Пользователь} -> пароль |
    * нажать на кнопку "Войти"
    * дождаться отображения страницы "Поиск клиента"

  Сценарий: Найти клиента
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * дождаться отображения страницы "Продукты клиента"

  Сценарий: Сравнить печатную форму с эталоном
    * сформировать шаблон "${Файл}.txt" в соответствии с инструкцией "${Инструкция}"
    * сформировать эталон "${Файл} эталон.pdf" по файлу "${Старый документ}.pdf" и шаблону "${Файл}.txt"
      | Параметр       | Значение        |
      | Номер договора | ${Номер заявки} |
      | ИНН            | ${ИНН}          |
      | Число          | ${Число}        |
      | Месяца         | ${Месяца}       |
      | Год            | ${Год}          |
    * сравнить файл "${Файл}.pdf" с эталоном "${Файл} эталон.pdf"

  Сценарий: Обновление страницы
    * обновить страницу