#language: ru
Функционал: Кредитная заявка

  Сценарий: Поиск и открытие заявки клиента
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец      | Значение        |
      | НОМЕР ЗАЯВКИ | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться отображения страницы "Кредитная заявка" в новой вкладке

  Сценарий: Удаление всех кредитных заявок клиента
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |

  Сценарий: Поиск заявки на форме заявок подразделения
    * в меню "Главное меню" выбрать "Кредитные заявки"
    * дождаться отображения страницы "Кредитные заявки (подразделения)"
    * заполнить поля формы значениями:
      | Тип               | Название           | Значение              |
      | выпадающий список | Канал подачи       | ${Канал подачи}       |
      | поле              | Заемщик            | ${Заемщик}            |
      | выпадающий список | Продуктовая группа | ${Продуктовая группа} |
      | выпадающий список | Статус             | Все статусы           |
    * выполнить сценарий "Ожидание смены статуса заявки на форме заявок подразделения"

  Сценарий: Поиск и открытие заявки на форме заявок подразделения
    * выполнить сценарий "Поиск заявки на форме заявок подразделения"
    * в найденной строке нажать на "Номер заявки"
    * дождаться отображения страницы "Кредитная заявка" в новой вкладке

  Сценарий: Ожидание смены статуса заявки на форме заявок подразделения
    * служебный шаг: повторять действия до выполнения условий "Заявка найдена"
    * нажать на кнопку "Показать"
    * в таблице "Кредитные заявки" дождаться появления строки, соответствующей условиям:
      | Столбец | Значение         |
      | НОМЕР   | ${Номер заявки}  |
      | СТАТУС  | ${Статус заявки} |

  Сценарий: Ожидание обработки заявки
    * выполнять сценарий "Кредитная заявка -> Получение истории обработки заявки" до выполнения условий:
      | Объект   | Название              | Состояние | Значение           | Ожидание  |
      | параметр | ${Название параметра} | содержит  | ${Ожидаемый текст} | 2 секунды |

  Сценарий: Получение истории обработки заявки
    * отправить GET-запрос "История кредитной заявки" с параметрами:
      | Параметр | Значение                                                            |
      | url      | ${Адрес стенда}/efrapi/credit/claim/${Идентификатор заявки}/history |
    * разобрать ответ запроса "История кредитной заявки", сохранив значения в параметрах:
      | Параметр           | Регулярное выражение    |
      | Ожидаемое значение | ${Регулярное выражение} |

  Сценарий: Перевод заявки на следующий шаг обработки
    * нажать на кнопку "Продолжить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"

  Сценарий: Прикрепление скан-копий документов
    * примечание: далее работаем в контексте блока "Документы"
    * нажать на "Печать анкеты заявления (односторонняя)" и скачать файл "Анкета-заявление на предоставление кредита.pdf"
    * выполнить сценарий "Кредитная заявка -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                          |
      | Тип документа      | Анкета                                            |
      | Прикрепляемый файл | ${Анкета-заявление на предоставление кредита.pdf} |
      | Тип файла          | PDF                                               |
    * выполнить сценарий "Кредитная заявка -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                                |
      | Тип документа      | Фото всех участников сделки                             |
      | Прикрепляемый файл | ${Скан-копии документов} -> Фото всех участников сделки |
      | Тип файла          | JPG                                                     |
    * выполнить сценарий "Кредитная заявка -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                                |
      | Тип документа      | Кредитное дело 1                                        |
      | Прикрепляемый файл | ${Скан-копии документов} -> Фото всех участников сделки |
      | Тип файла          | JPG                                                     |
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение                    |
      | ДОКУМЕНТ | Фото всех участников сделки |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"

  Сценарий: Прикрепление скан-копии документа
    * служебный шаг: повторять действия до выполнения условий "Отображается всплывающее окно"
    * нажать на кнопку "Добавить"
    * дождаться выполнения условий "Отображается всплывающее окно":
      | Объект           | Название                         | Состояние    | Ожидание  |
      | всплывающее окно | Приложение скан-копии документов | отображается | 2 секунды |
    * в выпадающем списке "Тип документа" выбрать "${Тип документа}"
    * нажать на "Прикрепить файл" и выбрать файл "${Прикрепляемый файл}"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение     |
      | ссылка | Файл     | содержит  | ${Тип файла} |
    * нажать на кнопку "Добавить"
    * дождаться закрытия всплывающего окна "Приложение скан-копии документов"
    * примечание: далее работаем в контексте блока "Документы"
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение         |
      | ДОКУМЕНТ | ${Тип документа} |

  Сценарий: Контрольная сверка документов мидл-офисом
    * открыть ещё один браузер
    * войти в "ЕФР" под учетными данными пользователя "Контролёр"
    * выполнить сценарий "Подтверждение документов работником мидл-офиса" с параметрами:
      | Параметр          | Значение                                                 |
      | Поиск по процессу | Обработка заявок на кредит, поданных через интернет-сайт |
      | Поиск по клиенту  | ${Клиент} -> фамилия И.О.                                |
      | Поиск по задаче   | Контрольная сверка документов мидл-офисом                |
      | Ожидаемый раздел  | Решение банка                                            |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * закрыть текущую вкладку
    * продолжить работу в открытом ранее браузере

  Сценарий: Подтверждение документов работником мидл-офиса
    * в меню "Главное меню" выбрать "Задачи"
    * дождаться отображения страницы "Задачи" в новой вкладке
    * примечание: далее работаем в контексте блока "Все задачи"
    * в таблице "Все задачи" найти строку, соответствующую условиям:
      | Столбец | Значение             |
      | ПРОЦЕСС | ${Поиск по процессу} |
      | КЛИЕНТ  | ${Поиск по клиенту}  |
      | ЗАДАЧА  | ${Поиск по задаче}   |
    * в найденной строке нажать на "Взять и исполнить"
    * дождаться отображения страницы "Кредитная заявка"
    * дождаться отображения блока "Параметры заявки -> ${Ожидаемый раздел}"
    * в блоке "Параметры заявки -> ${Ожидаемый раздел}" нажать на кнопку "Подтвердить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"

  Сценарий: Ожидание смены статуса заявки
    * служебный шаг: повторять действия до выполнения условий "Статус заявки: ${Статус}"
    * обновить страницу
    * в таблице "Кредитные заявки" дождаться появления строки, соответствующей условиям:
      | Столбец      | Значение        |
      | НОМЕР ЗАЯВКИ | ${Номер заявки} |
      | СТАТУС       | ${Статус}       |
