#language: ru
@000 @Smoke

Функционал: [000. Подготовка тестовых условий][001. Установка настроек]

  @000.001.001
  Сценарий: 001. Отключение настройки 'Включить проверку подозрительных сессий пользователей'
    * войти в "ЕФР" под учетными данными пользователя "Администратор системы (полный доступ)"
    * выполнить сценарий "Изменить значение настройки" с параметрами:
      | Параметр       | Значение                           |
      | Настройки      | Настройки микросервиса api-gateway |
      | Настройка      | checkSessionsEnabled               |
      | Новое значение | false                              |

  @000.001.002
  Сценарий: 002. Отключение настройки 'Признак запрета выбора способа выплаты "Наличными" для закрытия вклада до востребования'
    * войти в "ЕФР" под учетными данными пользователя "Администратор системы (полный доступ)"
    * выполнить сценарий "Изменить значение настройки" с параметрами:
      | Параметр       | Значение                                      |
      | Настройки      | Настройки микросервиса вкладов                |
      | Настройка      | writeOffFromCashForCloseDemandDepositDisabled |
      | Новое значение | false                                         |
