#language: ru
Функционал: [999. Отладка][001. Всякое]

  @999.001.001
  Сценарий: 001. Отладка сравнения печатных форм
  * определить значения тестовых параметров
  * выполнить сценарий "войти в ЕФР"
  * выполнить сценарий "Найти клиента"
  * в списке "Меню вкладок" выбрать "Данные клиента"
  * дождаться выполнения условий:
  | Объект   | Название       | Состояние    |
  | страница | Данные клиента | отображается |
  * сохранить значения поля "ИНН", как "ИНН"
  * выполнить сценарий "Открыть кредитную заявку" с параметрами:
  | Параметр           | Значение               |
  | Продуктовая группа | Потребительский кредит |
  | Статус             | Кредит выдан           |
  * в списке "Меню вкладок страницы" выбрать "Документы"
  * дождаться выполнения условий:
  | Объект   | Название                    | Состояние    |
  | страница | Кредитная заявка. Документы | отображается |
  | таблица  | Документы на кредит         | отображается |
  * нажать на кнопку "Печать анкеты-заявления (односторонняя)"
  * проверить документ "members.pdf" на соответствие эталону
  | Параметр       | Значение                       |
  | эталон         | ${Эталон анкеты}               |
  | инструкция     | ${Инструкция к шаблону анкеты} |
  | Номер договора | ${Номер заявки}                |
  | ИНН            | ${ИНН}                         |
  | Число          | ${Число}                       |
  | Месяца         | ${Месяца}                      |
  | Год            | ${Год}                         |

  #
  #    * дождаться выполнения условий:
  #      | Объект | Название    | Состояние |
  #      | файл   | members.pdf | загружен  |
  #      | файл   | print.pdf   | загружен  |
  #    * сохранить файл "members.pdf", как "${Анкета}.pdf"
  #    * сохранить файл "print.pdf", как "${Приложение}.pdf"
  #    * выполнить сценарий "Сравнить печатную форму с эталоном" с параметрами:
  #      | Параметр        | Значение                       |
  #      | Старый документ | ${Старая анкета}               |
  #      | Файл            | ${Анкета}                      |
  #      | Формат          | pdf                            |
  #      | Инструкция      | ${Инструкция к шаблону анкеты} |

  @999.001.002
  Сценарий: 002 третий сценарий
  * открыть браузер
  #    * открыть страницу "Просмотр ПДФ"
  #    * сравнить печатную форму с эталоном
  * сформировать шаблон "Шаблон 1.txt" в соответствии с таблицей
  | Тип шаблонов                                               | Название фрагмента |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_1.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_2.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_3.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_4.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_5.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_6.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_7.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_8.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_9.txt         |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_10.txt        |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_11.txt        |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_12.txt        |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_13.txt        |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_14.txt        |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_15.txt        |
  | Анкета-заявление на предоставление кредита (односторонняя) | Page_16.txt        |
  * сформировать эталон по файлу "Анкета-заявление на предоставление кредита (односторонняя).pdf" и шаблону "Шаблон 1.txt"
  | Параметр       | Значение              |
  | Номер договора | 444/6300/931241000145 |
  | ИНН            | 178226687066          |
  | Число          | 07                    |
  | Месяца         | мая                   |
  | Год            | 2023                  |
  * сравнить файл "Анкета-заявление на предоставление кредита (односторонняя).pdf" с эталоном
