#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Ввод заявки
    * выполнить сценарий "Кредитная заявка -> Поиск и открытие заявки клиента"
    * выполнить сценарий "Заполнение раздела 'Запрошенные параметры'"
    * в списке "Меню вкладок страницы" выбрать "Заемщик"
    * примечание: далее работаем в контексте блока "Заемщик"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Персональные данные'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Работа'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Доходы и расходы'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Иная информация'"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копий документов"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * дождаться выполнения условий "Статус заявки - Анализ и принятие решения":
      | Объект | Название | Состояние | Значение                  |
      | текст  | Статус   | содержит  | Анализ и принятие решения |

  Сценарий: Заполнение раздела 'Запрошенные параметры'
    * примечание: далее работаем в контексте блока "Параметры заявки"
    * нажать на кнопку "Продолжить"
    * заполнить поля формы в блоке "Запрошенные параметры (редактирование)" значениями:
      | Тип               | Название                               | Значение                                   |
      | выпадающий список | Сотрудник, осуществивший продажу       | 00500001 Осминин Е. С.                     |
      | переключатель     | Личное страхование Заемщика            | да                                         |
      | выпадающий список | Страховая программа                    | Страхование жизни и здоровья, телемедицина |
      | поле              | Страховая плата                        | 10000                                      |
      | поле              | Вознаграждения Банку                   | 1000                                       |
      | поле              | Страховая премия страховой организации | 2000                                       |
    * примечание: далее работаем в контексте текущей страницы

  Сценарий: Заполнение подраздела 'Персональные данные'
    * заполнить поля формы в блоке "Персональные данные" значениями:
      | Тип               | Название                                               | Значение          |
      | выпадающий список | Образование                                            | Высшее            |
      | поле              | СНИЛС                                                  | 78460631327       |
      | радио-кнопка      | Военный билет                                          | нет               |
      | выпадающий список | Тип жилья                                              | Собственность     |
      | выпадающий список | Семейное положение                                     | Холост/Не замужем |
      | поле              | Кол-во детей до 18 лет                                 | 1                 |
      | поле              | Кол-во иных иждивенцев, за исключением детей до 18 лет | 0                 |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Работа'
    * в списке "Меню вкладок подраздела" выбрать "Работа"
    * заполнить поля формы в блоке "Работа" значениями:
      | Тип               | Название                     | Значение                        |
      | выпадающий список | Информация о трудоустройстве | Безработный/Временно не работаю |
    * заполнить поля формы в блоке "Работа -> Общий стаж за последние 5 лет" значениями:
      | Тип  | Название | Значение |
      | поле | лет      | 5        |
      | поле | мес.     | 0        |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Доходы и расходы'
    * в списке "Меню вкладок подраздела" выбрать "Доходы и расходы"
    * заполнить поля формы в блоке "Доходы и расходы -> Доходы" значениями:
      | Тип               | Название                                              | Значение       |
      | выпадающий список | Способ подтверждения дохода по основному месту работы | Не подтвержден |
      | поле              | Основная зарплата                                     | 100000         |
      | выпадающий список | Способ подтверждения дополнительного дохода           | Не подтвержден |
      | поле              | Доход по совместительству                             | 12000          |
      | выпадающий список | Способ подтверждения пенсионных доходов               | Не подтвержден |
      | поле              | Пенсия                                                | 22000          |
      | выпадающий список | Способ подтверждения иных доходов                     | Не подтвержден |
      | поле              | Иные доходы                                           | 6000           |
    * заполнить поля формы в блоке "Доходы и расходы -> Расходы" значениями:
      | Тип  | Название             | Значение |
      | поле | Обязательные выплаты | 30000    |
      | поле | Алименты             | 25000    |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Иная информация'
    * в списке "Меню вкладок подраздела" выбрать "Иная информация"
    * заполнить поля формы в блоке "Иная информация" значениями:
      | Тип               | Название                    | Значение        |
      | выпадающий список | Отношение к воинской службе | Отслужил/Запаса |
    * сделать снимок страницы
    * нажать на кнопку "Продолжить"
    * примечание: выходим из текущего контекста и работаем в контексте блока "Параметры заявки"
    * дождаться отображения блока "Запрошенные параметры"

  Сценарий: Прикрепление скан-копии документа
    * служебный шаг: повторять действия до выполнения условий "Отображается всплывающее окно"
    * нажать на кнопку "Добавить"
    * дождаться выполнения условий "Отображается всплывающее окно":
      | Объект           | Название                         | Состояние    | Ожидание  |
      | всплывающее окно | Приложение скан-копии документов | отображается | 2 секунды |
    * в выпадающем списке "Тип документа" выбрать "${Тип документа}"
    * нажать на "Прикрепить файл" и выбрать файл "${Прикрепляемый файл}"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение     |
      | ссылка | Файл     | содержит  | ${Тип файла} |
    * нажать на кнопку "Добавить"
    * дождаться закрытия всплывающего окна "Приложение скан-копии документов"
    * примечание: далее работаем в контексте блока "Документы"
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение         |
      | Документ | ${Тип документа} |

  Сценарий: Прикрепление скан-копий документов
    * примечание: далее работаем в контексте блока "Документы"
    * нажать на "Печать анкеты заявления (односторонняя)" и скачать файл "Анкета-заявление на предоставление кредита.pdf"
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                          |
      | Тип документа      | Анкета                                            |
      | Прикрепляемый файл | ${Анкета-заявление на предоставление кредита.pdf} |
      | Тип файла          | PDF                                               |
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                                |
      | Тип документа      | Фото всех участников сделки                             |
      | Прикрепляемый файл | ${Скан-копии документов} -> Фото всех участников сделки |
      | Тип файла          | JPG                                                     |
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                                |
      | Тип документа      | Кредитное дело 1                                        |
      | Прикрепляемый файл | ${Скан-копии документов} -> Фото всех участников сделки |
      | Тип файла          | JPG                                                     |
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение                    |
      | Документ | Фото всех участников сделки |
    * сделать снимок страницы
