#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Выдача кредита
    * выполнить сценарий "Кредитная заявка через сайт -> Прохождение биоверификации"
#    * выполнить сценарий "Кредитная заявка через сайт -> Подтверждение параметров сделки"
#    * выполнить сценарий "Кредитная заявка через сайт -> Печать и подписание КОД"
#    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копий документов"
#    * выполнить сценарий "Кредитная заявка через сайт -> Подтверждение работником мидл-офиса"
#    * выполнить сценарий "Кредитная заявка через сайт -> Выдача"

  Сценарий: Прохождение биоверификации
    * закрыть текущую вкладку
    * служебный шаг: повторять действия до выполнения условий
    * обновить страницу
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение                   |
      | Статус  | Ожидание клиента на сделку |
    * выполнить сценарий "Поиск и открытие заявки клиента"
    * нажать на кнопку "Создать КОД"
    * дождаться отображения блока "Верификация"
    * примечание: далее работаем в контексте блока "Верификация"
    * в таблице "Данные заемщика" найти строку, соответствующую условиям:
      | Столбец | Значение              |
      | ФИО     | ${Клиент} -> имя      |
      | ФИО     | ${Клиент} -> фамилия  |
      | ФИО     | ${Клиент} -> отчество |
    * в найденной строке нажать на "Верифицировать"
    * дождаться выполнения условий "Кнопка 'Продолжить' активна":
      | Объект | Название   | Состояние |
      | кнопка | Продолжить | активна   |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Верификация"
    * примечание: далее работаем в контексте текущей страницы
    * служебный шаг: повторять действия до выполнения условий "Отображается вкладка 'Запрошенные параметры'"
    * в блоке "Верификация" нажать на кнопку "Продолжить"
    * дождаться выполнения условий "Отображается вкладка 'Запрошенные параметры'":
      | Объект         | Название              | Состояние    | Ожидание |
      | блок элементов | Параметры заявки      | отображается | 5 секунд |
      | блок элементов | Запрошенные параметры | отображается | 5 секунд |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Запрошенные параметры"
    * нажать на кнопку "Задать параметры выдачи"
    * дождаться выполнения условий "Статус заявки: Подготовка КОД":
      | Объект         | Название         | Состояние    | Значение       |
      | текст          | Статус           | содержит     | Подготовка КОД |
      | блок элементов | Параметры выдачи | отображается |                |
    * дождаться отображения блока "Параметры выдачи"
    * заполнить поля формы в блоке "Параметры выдачи" значениями:
      | Тип               | Название       | Значение                |
      | поле              | Сумма кредита  | 120000                  |
      | выпадающий список | День платежа   | 5 числа месяца          |
      | выпадающий список | Форма расчетов | Выдача на счёт          |
      | выпадающий список | Счет           | 408 17 810 163000000224 |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Параметры выдачи"
    * нажать на кнопку "Далее"
    * дождаться отображения блока "Страхование"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Страхование"
    * в блоке "Страхование" нажать на кнопку "Оформить"
    * дождаться отображения блока "Параметры заявки -> Запрошенные параметры"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Запрошенные параметры"
