#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Идентификация клиента
    * выполнить сценарий "Поиск заявки на форме заявок подразделения" с параметрами:
      | Параметр           | Значение                |
      | Канал подачи       | Интернет-сайт           |
      | Продуктовая группа | Потребительский кредит  |
      | Статус             | Предварительное решение |
    * нажать на кнопку "Идентифицировать клиента"
    * дождаться отображения страницы "Идентификация клиента"
    * нажать на кнопку "Поиск клиента"
    * дождаться выполнения условий "В новой вкладке открылась страница 'Поиск клиента'":
      | Объект   | Название      | Состояние    |
      | вкладка  | 2             | открыта      |
      | страница | Поиск клиента | отображается |
    * в блоке "Результаты" нажать на кнопку "Выбрать"
    * дождаться отображения страницы "Сведения о Заёмщике"
    * нажать на кнопку "Связать с кредитной заявкой"
    * дождаться отображения страницы "Прикрепление согласий Заёмщика"
    * нажать на "Односторонняя печать" и скачать файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * нажать на "Прикрепить файл" и выбрать загруженный файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение |
      | ссылка | Файл     | содержит  | PDF      |
    * нажать на кнопку "Продолжить"
    * дождаться отображения страницы "Редактирование клиента"
    * нажать на "Печать заявления на изменение сведений (Односторонняя печать)" и скачать файл "Заявление на изменение сведений.pdf"
    * нажать на кнопку "Сохранить"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитные заявки | отображается |
      | таблица  | Кредитные заявки | отображается |