#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Идентификация клиента
    * выполнить сценарий "Поиск и открытие заявки на форме заявок подразделения" с параметрами:
      | Параметр           | Значение                   |
      | Канал подачи       | Интернет-сайт              |
      | Заемщик            | ${Клиент} -> фамилия       |
      | Продуктовая группа | Потребительский кредит     |
      | Статус заявки      | ${Начальный статус заявки} |
    * закрыть вкладку 1
    * нажать на кнопку "Идентифицировать клиента"
    * дождаться отображения страницы "Идентификация клиента"
    * нажать на кнопку "Поиск клиента"
    * дождаться выполнения условий "Открылась страница 'Поиск клиента'":
      | Объект   | Название      | Состояние    |
      | страница | Поиск клиента | отображается |
    * в блоке "Результаты" нажать на кнопку "Выбрать"
    * дождаться отображения страницы "Сведения о Заёмщике"
    * нажать на кнопку "Связать с кредитной заявкой"
    * дождаться отображения страницы "Прикрепление согласий Заёмщика"
    * нажать на "Односторонняя печать" и скачать файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * нажать на "Прикрепить файл" и выбрать загруженный файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение |
      | ссылка | Файл     | содержит  | PDF      |
    * нажать на кнопку "Продолжить"
    * дождаться отображения страницы "Редактирование клиента"
    * нажать на "Печать заявления на изменение сведений (Односторонняя печать)" и скачать файл "Заявление на изменение сведений.pdf"
    * нажать на кнопку "Сохранить"
    * дождаться отображения страницы "Кредитные заявки"
    * дождаться отображения таблицы "Кредитные заявки"
