#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Сверка
    * нажать на кнопку "Создать КОД"
    * выполнить сценарий "Заполнение раздела 'Проверка сведений о доходах'"
    * выполнить сценарий "Заполнение раздела 'Визуальная оценка'"
    * примечание: далее работаем в контексте блока "Документы"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * дождаться отображения блока "Параметры заявки -> Решение банка"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * закрыть текущую вкладку
    * выполнить сценарий "Контрольная сверка документов мидл-офисом"

  Сценарий: Заполнение раздела 'Проверка сведений о доходах'
    * дождаться отображения блока "Проверка сведений о доходах"
    * примечание: далее работаем в контексте блока "Проверка сведений о доходах"
    * заполнить поля формы значениями:
      | Тип           | Блок                 | Название                                             | Значение |
      | переключатель | Основной доход       | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Пенсионный доход     | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Дополнительный доход | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Иные доходы          | Сведения о доходе соответствуют заявленным в заявке? | да       |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Проверка сведений о доходах"
    * нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться отображения блока "Визуальная оценка"

  Сценарий: Заполнение раздела 'Визуальная оценка'
    * примечание: далее работаем в контексте блока "Визуальная оценка"
    * заполнить поля формы значениями:
      | Тип           | Название                                                          | Значение |
      | переключатель | У клиента имеются признаки алкогольного/наркотического опьянения? | нет      |
      | переключатель | У клиента наблюдаются явные отклонения в психическом состоянии?   | нет      |
      | переключатель | У клиента имеются видимые отклонения в физическом состоянии?      | нет      |
      | переключатель | У клиента имеются признаки судимости?                             | нет      |
      | переключатель | Ведет ли клиент себя неадекватно?                                 | нет      |
      | переключатель | Выглядит ли клиент неопрятно?                                     | нет      |
      | переключатель | Клиента сопровождают?                                             | нет      |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Визуальная оценка"
    * нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться отображения блока "Документы"

  Сценарий: Контрольная сверка документов мидл-офисом
    * открыть ещё один браузер
    * войти в "ЕФР" под учетными данными пользователя "Контролёр"
    * выполнить сценарий "Кредитная заявка -> Подтверждение документов работником мидл-офиса" с параметрами:
      | Параметр          | Значение                                                 |
      | Поиск по процессу | Обработка заявок на кредит, поданных через интернет-сайт |
      | Поиск по клиенту  | ${Клиент} -> фамилия И.О.                                |
      | Поиск по задаче   | Контрольная сверка документов мидл-офисом                |
      | Ожидаемый раздел  | Решение банка                                            |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * закрыть текущую вкладку
    * продолжить работу в открытом ранее браузере

