#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Сверка
    * нажать на кнопку "Создать КОД"
    * выполнить сценарий "Заполнение раздела 'Проверка сведений о доходах'"
    * выполнить сценарий "Заполнение раздела 'Визуальная оценка'"
    * примечание: далее работаем в контексте блока "Документы"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * дождаться отображения блока "Параметры заявки -> Решение банка"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * выполнить сценарий "Подтверждение сверки контролёром"

  Сценарий: Заполнение раздела 'Проверка сведений о доходах'
    * дождаться отображения блока "Проверка сведений о доходах"
    * примечание: далее работаем в контексте блока "Проверка сведений о доходах"
    * заполнить поля формы значениями:
      | Тип           | Блок                 | Название                                             | Значение |
      | переключатель | Основной доход       | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Пенсионный доход     | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Дополнительный доход | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Иные доходы          | Сведения о доходе соответствуют заявленным в заявке? | да       |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Проверка сведений о доходах"
    * нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться отображения блока "Визуальная оценка"

  Сценарий: Заполнение раздела 'Визуальная оценка'
    * примечание: далее работаем в контексте блока "Визуальная оценка"
    * заполнить поля формы значениями:
      | Тип           | Название                                                          | Значение |
      | переключатель | У клиента имеются признаки алкогольного/наркотического опьянения? | нет      |
      | переключатель | У клиента наблюдаются явные отклонения в психическом состоянии?   | нет      |
      | переключатель | У клиента имеются видимые отклонения в физическом состоянии?      | нет      |
      | переключатель | У клиента имеются признаки судимости?                             | нет      |
      | переключатель | Ведет ли клиент себя неадекватно?                                 | нет      |
      | переключатель | Выглядит ли клиент неопрятно?                                     | нет      |
      | переключатель | Клиента сопровождают?                                             | нет      |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Визуальная оценка"
    * нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться отображения блока "Документы"

  Сценарий: Подтверждение сверки контролёром
    * открыть ещё один браузер
    * войти в "ЕФР" под учетными данными пользователя "Контролёр"
    * в меню "Главное меню" выбрать "Задачи"
    * дождаться отображения страницы "Задачи" в новой вкладке
    * примечание: далее работаем в контексте блока "Все задачи"
    * в таблице "Все задачи" найти строку, соответствующую условиям:
      | Столбец | Значение                                                 |
      | ПРОЦЕСС | Обработка заявок на кредит, поданных через интернет-сайт |
      | КЛИЕНТ  | Интернеткредит К. К.                                     |
      | ЗАДАЧА  | Контрольная сверка документов мидл-офисом                |
    * в найденной строке нажать на "Взять и исполнить"
    * дождаться отображения страницы "Кредитная заявка"
    * дождаться отображения блока "Параметры заявки -> Решение банка"
    * нажать на кнопку "Подтвердить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * продолжить работу в открытом ранее браузере
