#language: ru
@01

Функционал: 01. Анкета клиента
  @01.01
  Сценарий: 01.01 Заполнение анкеты клиента
    * открыть браузер "chromium"
    * войти в "ЕФР" под учётными данными сотрудника "MANAGER_OPERATOR_GO"
    * заполнить поля формы значениями:
      | Серия | ${Серия} |
      | Номер | ${Номер} |
    * нажать на кнопку "Найти"
    * нажать на кнопку "Новый клиент"

  @01.02
  Сценарий: 01.02 второй сценарий
    * подготовить тестовые параметры
    * открыть браузер "chromium"
    * войти в "ЕФР" под учётными данными сотрудника "MANAGER_OPERATOR_GO"
    * найти клиента по серии "${Клиент} -> серия паспорта" и номеру "${Клиент} -> номер паспорта" паспорта

  @01.03
  Сценарий: 01.03 третий сценарий
    * подготовить тестовые параметры
    * открыть браузер "chromium"
    * войти в "ЕФР" под учётными данными сотрудника "MANAGER_OPERATOR_8300_MANAGE_OPTIONS"
    * найти клиента по серии "1092" и номеру "100092" паспорта
