#language: ru
@01

Функционал: 01. Анкета клиента

  @01.01 @Smoke
  Сценарий: 01.01 Заполнение анкеты нового клиента. Отмена от сохранения изменений
    * подготовить тестовые параметры
    * войти в "ЕФР" под учётными данными сотрудника "MANAGER_OPERATOR_GO"
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * нажать на кнопку "Новый клиент"
    Тогда ожидаемый результат:
      | Объект   | Название         | Состояние       |
      | кнопка   | Новый клиент     | не отображается |
      | страница | Создание клиента | отображается    |
    * нажать на кнопку "Полная идентификация"
    * заполнить поля формы значениями:
      | Тип          | Название                  | Значение                   |
      | файл         | Аватар                    | ${Клиент} -> аватар        |
      | поле         | Фамилия                   | ${Клиент} -> фамилия       |
      | поле         | Имя                       | ${Клиент} -> имя           |
      | поле         | Отчество                  | ${Клиент} -> отчество      |
      | поле         | Фамилия и Имя на латинице | ${Клиент} -> на латинице   |
      | дата         | Дата рождения             | ${Клиент} -> дата рождения |
      | радио-кнопка | Пол                       | ${Клиент} -> пол           |
    * нажать на кнопку "Добавить (гражданство)"
    * дождаться отображения всплывающего окна "Выберите страну"
    * ввести в поле "Название" значение "${Клиент} -> страна"
    * нажать на кнопку "Показать"
    * в списке "Страны" выбрать значение "${Клиент} -> страна"
    * дождаться закрытия всплывающего окна

  @01.02
  Сценарий: 01.02 второй сценарий
    * подготовить тестовые параметры
    * открыть браузер "chromium"
    * войти в "ЕФР" под учётными данными сотрудника "MANAGER_OPERATOR_GO"
    * найти клиента по серии "${Клиент} -> серия паспорта" и номеру "${Клиент} -> номер паспорта" паспорта

  @01.03
  Сценарий: 01.03 третий сценарий
    * подготовить тестовые параметры
    * открыть браузер "chromium"
    * войти в "ЕФР" под учётными данными сотрудника "MANAGER_OPERATOR_8300_MANAGE_OPTIONS"
    * найти клиента по серии "1092" и номеру "100092" паспорта
