#language: ru
Функционал: КЗ через сайт. Короткая анкета

  Сценарий: Сверка
    * выполнить сценарий "Кредитная заявка через сайт -> Создание КОД"
    * примечание: далее работаем в контексте блока "Документы"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * дождаться отображения блока "Параметры заявки -> Решение банка"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * закрыть текущую вкладку
    * выполнить сценарий "Кредитная заявка -> Контрольная сверка документов мидл-офисом"

