#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Анализ и принятие решения
    * отправить POST-запрос "efr_SaveApplication" с параметрами:
      | Параметр          | Значение                                    |
      | ApplicationDate   | ${CreateApplicationShortEFR} -> CurrentDate |
      | ApplicationNumber | ${Номер заявки}                             |
    * выполнять сценарий "Обновление страницы" до выполнения условий:
      | Объект   | Название         | Состояние    | Значение                   | Ожидание  |
      | страница | Кредитная заявка | отображается |                            | 30 секунд |
      | текст    | Статус           | содержит     | Ожидание клиента на сделку | 2 секунды |
    * сделать снимок страницы
