#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Прохождение биоверификации
    * служебный шаг: повторять действия до выполнения условий
    * обновить страницу
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение                   |
      | СТАТУС  | Ожидание клиента на сделку |
    * выполнить сценарий "Поиск и открытие заявки клиента"
    * в блоке "Параметры заявки" нажать на кнопку "Создать КОД"
    * дождаться отображения блока "Верификация"
    * примечание: далее работаем в контексте блока "Верификация"
    * в таблице "Данные заемщика" найти строку, соответствующую условиям:
      | Столбец | Значение              |
      | ФИО     | ${Клиент} -> имя      |
      | ФИО     | ${Клиент} -> фамилия  |
      | ФИО     | ${Клиент} -> отчество |
    * в найденной строке нажать на "Верифицировать"
    * дождаться выполнения условий "Кнопка 'Продолжить' активна":
      | Объект | Название   | Состояние |
      | кнопка | Продолжить | активна   |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Верификация"
    * примечание: далее работаем в контексте текущей страницы
    * служебный шаг: повторять действия до выполнения условий "Отображается вкладка 'Запрошенные параметры'"
    * в блоке "Верификация" нажать на кнопку "Продолжить"
    * дождаться выполнения условий "Отображается вкладка 'Параметры заявки'":
      | Объект    | Название         | Состояние    | Ожидание  |
      | контейнер | Параметры заявки | отображается | 20 секунд |
    * дождаться отображения блока "Параметры заявки -> Запрошенные параметры"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Запрошенные параметры"

  Сценарий: Подтверждение параметров сделки
    * нажать на кнопку "Задать параметры выдачи"
    * дождаться выполнения условий "Статус заявки: Подготовка КОД":
      | Объект    | Название         | Состояние    | Значение       |
      | текст     | Статус           | содержит     | Подготовка КОД |
      | контейнер | Параметры выдачи | отображается |                |
    * дождаться отображения блока "Параметры выдачи"
    * заполнить поля формы в блоке "Параметры выдачи" значениями:
      | Тип               | Название       | Значение                |
      | поле              | Сумма кредита  | 120000                  |
      | выпадающий список | День платежа   | 5 числа месяца          |
      | выпадающий список | Форма расчетов | Выдача на счёт          |
      | выпадающий список | Счет           | 408 17 810 163000000224 |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Параметры выдачи"
    * в блоке "Параметры выдачи" нажать на кнопку "Далее"
    * дождаться отображения блока "Страхование"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Страхование"
    * в блоке "Страхование" нажать на кнопку "Оформить"
    * дождаться отображения блока "Параметры заявки -> Запрошенные параметры"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Запрошенные параметры"

  Сценарий: Печать и подписание КОД
    * нажать на кнопку "Печать КОД"
    * дождаться отображения всплывающего окна "Печать КОД"
    * в выпадающем списке "Ответственный исполнитель" выбрать "Лепихина Ирина Сергеевна"
    * нажать на "Печать (односторонняя)" и скачать файл "Досье по кредитам физических лиц.pdf"
    * дождаться закрытия всплывающего окна "Печать КОД"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * дождаться отображения блока "Документы"

  Сценарий: Прикрепление скан-копии КОД
    * примечание: далее работаем в контексте блока "Документы"
    * выполнить сценарий "Кредитная заявка -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                |
      | Тип документа      | Кредитный договор                       |
      | Прикрепляемый файл | ${Досье по кредитам физических лиц.pdf} |
      | Тип файла          | PDF                                     |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы."
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"
    * дождаться отображения блока "Параметры заявки"
    * закрыть текущую вкладку

  Сценарий: Подтверждение работником мидл-офиса
    * продолжить работу в браузере № 2
    * выполнить сценарий "Кредитная заявка -> Подтверждение документов работником мидл-офиса" с параметрами:
      | Параметр          | Значение                                                 |
      | Поиск по процессу | Обработка заявок на кредит, поданных через интернет-сайт |
      | Поиск по клиенту  | ${Клиент} -> фамилия И.О.                                |
      | Поиск по задаче   | Подтверждение работником мидл-офиса                      |
      | Ожидаемый раздел  | Запрошенные параметры                                    |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * закрыть текущую вкладку
    * продолжить работу в открытом ранее браузере

  Сценарий: Выдача
    * выполнить сценарий "Кредитная заявка -> Ожидание смены статуса заявки" с параметрами:
      | Параметр | Значение       |
      | Статус   | Выдача кредита |
    * отправить POST-запрос "AnswerChangeCreditStatusEFR" с параметрами:
      | Параметр     | Значение        |
      | Номер заявки | ${Номер заявки} |
    * выполнить сценарий "Кредитная заявка -> Ожидание смены статуса заявки" с параметрами:
      | Параметр | Значение     |
      | Статус   | Кредит выдан |
    * выполнить сценарий "Поиск и открытие заявки клиента"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Кредит выдан"