#language: ru
@00

Функционал: 00. Подготовка тестовых условий

  @00.01
  Сценарий: 00.01 Отключение настройки 'Включить проверку подозрительных сессий пользователей'
    * подготовить тестовые параметры
    * войти в "ЕФР" под учетными данными пользователя "Администратор системы (полный доступ)"
    * выполнить сценарий "Изменить значение настройки" с параметрами:
      | Параметр       | Значение                           |
      | Настройки      | Настройки микросервиса api-gateway |
      | Настройка      | checkSessionsEnabled               |
      | Новое значение | false                              |

  @00.02
  Сценарий: 00.02 Отключение настройки 'safBranchOn'
    * подготовить тестовые параметры
    * войти в "ЕФР" под учетными данными пользователя "Администратор системы (полный доступ)"
    * выполнить сценарий "Изменить значение настройки" с параметрами:
      | Параметр       | Значение                         |
      | Настройки      | Настройки микросервиса переводов |
      | Настройка      | safBranchOn                      |
      | Новое значение | -                                |
    * выполнить сценарий "Изменить значение настройки" с параметрами:
      | Параметр       | Значение                        |
      | Настройки      | Настройки микросервиса платежей |
      | Настройка      | safBranchOn                     |
      | Новое значение | -                               |
