#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Ввод заявки
    * выполнить сценарий "Кредитная заявка -> Поиск и открытие заявки клиента"
    * выполнить сценарий "Заполнение раздела 'Запрошенные параметры'"
    * в списке "Меню вкладок страницы" выбрать "Заемщик"
    * примечание: далее работаем в контексте блока "Заемщик"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Персональные данные'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Работа'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Доходы и расходы'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Иная информация'"
    * выполнить сценарий "Кредитная заявка -> Прикрепление скан-копий документов"
    * дождаться выполнения условий "Статус заявки: Анализ и принятие решения":
      | Объект | Название | Состояние | Значение                  |
      | текст  | Статус   | содержит  | Анализ и принятие решения |

  Сценарий: Заполнение раздела 'Запрошенные параметры'
    * примечание: далее работаем в контексте блока "Параметры заявки"
    * нажать на кнопку "Продолжить"
    * заполнить поля формы в блоке "Запрошенные параметры (редактирование)" значениями:
      | Тип               | Название                               | Значение                                   |
      | выпадающий список | Сотрудник, осуществивший продажу       | 00500001 Осминин Е. С.                     |
      | переключатель     | Личное страхование Заемщика            | да                                         |
      | выпадающий список | Страховая программа                    | Страхование жизни и здоровья, телемедицина |
      | поле              | Страховая плата                        | 10000                                      |
      | поле              | Вознаграждения Банку                   | 1000                                       |
      | поле              | Страховая премия страховой организации | 2000                                       |
    * примечание: далее работаем в контексте текущей страницы

  Сценарий: Заполнение подраздела 'Персональные данные'
    * заполнить поля формы в блоке "Персональные данные" значениями:
      | Тип               | Название                                               | Значение          |
      | выпадающий список | Образование                                            | Высшее            |
      | поле              | СНИЛС                                                  | 78460631327       |
      | радио-кнопка      | Военный билет                                          | нет               |
      | выпадающий список | Тип жилья                                              | Собственность     |
      | выпадающий список | Семейное положение                                     | Холост/Не замужем |
      | поле              | Кол-во детей до 18 лет                                 | 1                 |
      | поле              | Кол-во иных иждивенцев, за исключением детей до 18 лет | 0                 |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Работа'
    * в списке "Меню вкладок подраздела" выбрать "Работа"
    * заполнить поля формы в блоке "Работа" значениями:
      | Тип               | Название                     | Значение                        |
      | выпадающий список | Информация о трудоустройстве | Безработный/Временно не работаю |
    * заполнить поля формы в блоке "Работа -> Общий стаж за последние 5 лет" значениями:
      | Тип  | Название | Значение |
      | поле | лет      | 5        |
      | поле | мес.     | 0        |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Доходы и расходы'
    * в списке "Меню вкладок подраздела" выбрать "Доходы и расходы"
    * заполнить поля формы в блоке "Доходы и расходы -> Доходы" значениями:
      | Тип               | Название                                              | Значение       |
      | выпадающий список | Способ подтверждения дохода по основному месту работы | Не подтвержден |
      | поле              | Основная зарплата                                     | 100000         |
      | выпадающий список | Способ подтверждения дополнительного дохода           | Не подтвержден |
      | поле              | Доход по совместительству                             | 12000          |
      | выпадающий список | Способ подтверждения пенсионных доходов               | Не подтвержден |
      | поле              | Пенсия                                                | 22000          |
      | выпадающий список | Способ подтверждения иных доходов                     | Не подтвержден |
      | поле              | Иные доходы                                           | 6000           |
    * заполнить поля формы в блоке "Доходы и расходы -> Расходы" значениями:
      | Тип  | Название             | Значение |
      | поле | Обязательные выплаты | 30000    |
      | поле | Алименты             | 25000    |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Иная информация'
    * в списке "Меню вкладок подраздела" выбрать "Иная информация"
    * заполнить поля формы в блоке "Иная информация" значениями:
      | Тип               | Название                    | Значение        |
      | выпадающий список | Отношение к воинской службе | Отслужил/Запаса |
    * сделать снимок страницы
    * нажать на кнопку "Продолжить"
    * примечание: выходим из текущего контекста и работаем в контексте блока "Параметры заявки"
    * дождаться отображения блока "Запрошенные параметры"
    * выполнить сценарий "Кредитная заявка -> Перевод заявки на следующий шаг обработки"

