#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Создание КОД
    * в блоке "Параметры заявки" нажать на кнопку "Создать КОД"
    * выполнить сценарий "Заполнение раздела 'Проверка сведений о доходах'"
    * выполнить сценарий "Заполнение раздела 'Визуальная оценка'"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы"

  Сценарий: Заполнение раздела 'Проверка сведений о доходах'
    * примечание: далее работаем в контексте блока "Проверка сведений о доходах"
    * заполнить поля формы значениями:
      | Тип           | Блок                 | Название                                             | Значение |
      | переключатель | Основной доход       | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Пенсионный доход     | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Дополнительный доход | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Иные доходы          | Сведения о доходе соответствуют заявленным в заявке? | да       |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Проверка сведений о доходах"
    * нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться отображения блока "Визуальная оценка"

  Сценарий: Заполнение раздела 'Визуальная оценка'
    * примечание: далее работаем в контексте блока "Визуальная оценка"
    * заполнить поля формы значениями:
      | Тип           | Название                                                          | Значение |
      | переключатель | У клиента имеются признаки алкогольного/наркотического опьянения? | нет      |
      | переключатель | У клиента наблюдаются явные отклонения в психическом состоянии?   | нет      |
      | переключатель | У клиента имеются видимые отклонения в физическом состоянии?      | нет      |
      | переключатель | У клиента имеются признаки судимости?                             | нет      |
      | переключатель | Ведет ли клиент себя неадекватно?                                 | нет      |
      | переключатель | Выглядит ли клиент неопрятно?                                     | нет      |
      | переключатель | Клиента сопровождают?                                             | нет      |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Визуальная оценка"
    * нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться отображения блока "Документы"
