#language: ru
@002
@002.002

Функционал: [002. Заявка на кредит][002. Через сайт]

  @002.002.001
  Сценарий: 001. Действующий клиент. Короткая анкета. Выдача.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * выполнить сценарий "Кредитная заявка -> Удаление всех кредитных заявок клиента"
    * выполнить сценарий "Кредитная заявка через сайт -> Приём заявки"
    * выполнить сценарий "Кредитная заявка через сайт -> Идентификация клиента"
    * выполнить сценарий "Кредитная заявка через сайт -> Ввод заявки"
    * выполнить сценарий "Кредитная заявка через сайт -> Анализ и принятие решения"
    * выполнить сценарий "Кредитная заявка через сайт -> Сверка"
    * выполнить сценарий "Кредитная заявка через сайт -> Выдача кредита"
