#language: ru
@002
@002.002

Функционал: [002. Заявка на кредит][002. Через сайт]

  @002.002.001
  Сценарий: 001. Действующий клиент. Короткая анкета. Выдача.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |
    * отправить POST-запрос "CreateApplicationShortEFR" с параметрами:
      | Параметр                  | Значение                                                  |
      | CanalSales                | ${CreateApplicationShortEFR} -> CanalSales                |
      | CurrentDate               | ${CreateApplicationShortEFR} -> CurrentDate               |
      | Summa                     | ${CreateApplicationShortEFR} -> Summa                     |
      | PeriodLoan                | ${CreateApplicationShortEFR} -> PeriodLoan                |
      | LoanTarget                | ${CreateApplicationShortEFR} -> LoanTarget                |
      | Direction                 | ${CreateApplicationShortEFR} -> Direction                 |
      | IncomeMedium              | ${CreateApplicationShortEFR} -> IncomeMedium              |
      | ProductCode               | ${CreateApplicationShortEFR} -> ProductCode               |
      | CurrencyCode              | ${CreateApplicationShortEFR} -> CurrencyCode              |
      | BranchId                  | ${CreateApplicationShortEFR} -> BranchId                  |
      | LoanId                    | ${CreateApplicationShortEFR} -> LoanId                    |
      | ClientType                | ${CreateApplicationShortEFR} -> ClientType                |
      | IsCheckBKI                | ${CreateApplicationShortEFR} -> IsCheckBKI                |
      | IsConsentAssignmentClaims | ${CreateApplicationShortEFR} -> IsConsentAssignmentClaims |
      | IsProcessPersonalData     | ${CreateApplicationShortEFR} -> IsProcessPersonalData     |
      | IsRegistrationLocation    | ${CreateApplicationShortEFR} -> IsRegistrationLocation    |
      | IsReliableCustomer        | ${CreateApplicationShortEFR} -> IsReliableCustomer        |
      | IsBudgetOrgEmployee       | ${CreateApplicationShortEFR} -> IsBudgetOrgEmployee       |
      | IsSalaryRSHB              | ${CreateApplicationShortEFR} -> IsSalaryRSHB              |
      | IsPensionRSHB             | ${CreateApplicationShortEFR} -> IsPensionRSHB             |
      | ConsentBKIDate            | ${CreateApplicationShortEFR} -> ConsentBKIDate            |
      | IsCheckScore              | ${CreateApplicationShortEFR} -> IsCheckScore              |
      | IsConsentSMSBKI           | ${CreateApplicationShortEFR} -> IsConsentSMSBKI           |
      | BKIHashCode               | ${CreateApplicationShortEFR} -> BKIHashCode               |
      | BKIConsentPeriod          | ${CreateApplicationShortEFR} -> BKIConsentPeriod          |
      | ConsentUserType           | ${CreateApplicationShortEFR} -> ConsentUserType           |
      | StockCode                 | ${CreateApplicationShortEFR} -> StockCode                 |
      | DocumentType              | Паспорт                                                   |
      | docSeries                 | ${Паспорт} -> серия                                       |
      | docNumber                 | ${Паспорт} -> номер                                       |
      | Issued                    | ${Паспорт} -> кем выдан                                   |
      | IssueDate                 | ${Паспорт} -> дата выдачи                                 |
      | SubdivisionCode           | ${Паспорт} -> код подразделения                           |
      | clientLastName            | ${Клиент} -> фамилия                                      |
      | clientFirstName           | ${Клиент} -> имя                                          |
      | clientMiddleName          | ${Клиент} -> отчество                                     |
      | clientBirthDate           | ${Клиент} -> дата рождения                                |
      | clientBirthPlace          | ${Клиент} -> место рождения                               |
      | clientPhone               | ${Клиент} -> телефон                                      |
      | clientEMail               | ${Клиент} -> e-mail                                       |
      | clientRegDate             | ${Клиент} -> дата регистрации                             |
      | clientGender              | ${Клиент} -> пол                                          |
      | residenceIndex            | ${Адрес регистрации} -> индекс                            |
      | residenceDistrict         | ${Адрес регистрации} -> район                             |
      | residenceCity             | ${Адрес регистрации} -> город                             |
      | residenceLocality         | ${Адрес регистрации} -> населенный пункт                  |
      | residenceStreet           | ${Адрес регистрации} -> улица                             |
      | residenceHouse            | ${Адрес регистрации} -> номер дома                        |
      | residenceBuilding         | ${Адрес регистрации} -> строение                          |
      | residenceCorps            | ${Адрес регистрации} -> корпус                            |
      | residenceApartment        | ${Адрес регистрации} -> номер квартиры                    |
      | residenceRegionCode       | ${Адрес регистрации} -> код региона                       |
      | realIndex                 | ${Адрес регистрации} -> индекс                            |
      | realDistrict              | ${Адрес регистрации} -> район                             |
      | realCity                  | ${Адрес регистрации} -> город                             |
      | realLocality              | ${Адрес регистрации} -> населенный пункт                  |
      | realStreet                | ${Адрес регистрации} -> улица                             |
      | realHouse                 | ${Адрес регистрации} -> номер дома                        |
      | realBuilding              | ${Адрес регистрации} -> строение                          |
      | realCorps                 | ${Адрес регистрации} -> корпус                            |
      | realApartment             | ${Адрес регистрации} -> номер квартиры                    |
      | realRegionCode            | ${Адрес регистрации} -> код региона                       |
    * разобрать ответ запроса "CreateApplicationShortEFR", сохранив значения в параметрах:
      | Параметр             | Регулярное выражение                     |
      | Номер заявки         | LoanId.+?ObjectId>(.+?)<.+ObjectId>      |
      | Идентификатор заявки | ExternalId.+?ObjectId>(\d+?)<.+ObjectId> |
    * отправить POST-запрос "creditCalcEFR" с параметрами:
      | Параметр     | Значение        |
      | номер заявки | ${Номер заявки} |
    * служебный шаг: повторять действия до выполнения условий
    * отправить GET-запрос "История кредитной заявки" с параметрами:
      | Параметр | Значение                                                            |
      | url      | ${Адрес стенда}/efrapi/credit/claim/${Идентификатор заявки}/history |
    * разобрать ответ запроса "История кредитной заявки", сохранив значения в параметрах:
      | Параметр           | Регулярное выражение                                                                         |
      | Ожидаемое значение | edit-claim-data.+?preliminary-limit-calc.+?(Предварительный расчет лимита).+?edit-claim-data |
    * дождаться выполнения условий:
      | Объект   | Название           | Состояние | Значение                      | Ожидание  |
      | параметр | Ожидаемое значение | содержит  | Предварительный расчет лимита | 2 секунды |
    * отправить POST-запрос "creditCalcEFR" с параметрами:
      | Параметр     | Значение        |
      | номер заявки | ${Номер заявки} |
    * служебный шаг: повторять действия до выполнения условий
    * отправить GET-запрос "История кредитной заявки" с параметрами:
      | Параметр | Значение                                                            |
      | url      | ${Адрес стенда}/efrapi/credit/claim/${Идентификатор заявки}/history |
    * дождаться выполнения условий:
      | Объект   | Название                                     | Состояние | Значение                            | Ожидание  |
      | параметр | Результат запроса 'История кредитной заявки' | содержит  | Расчетная сумма кредита равна 50000 | 2 секунды |
    * в меню "Главное меню" выбрать "Кредитные заявки"
    * дождаться отображения страницы "Кредитные заявки (подразделения)"
    * заполнить поля формы значениями:
      | Тип               | Название           | Значение                |
      | выпадающий список | Канал подачи       | Интернет-сайт           |
      | поле              | Заемщик            | ${Клиент} -> фамилия    |
      | выпадающий список | Продуктовая группа | Потребительский кредит  |
      | выпадающий список | Статус             | Предварительное решение |
    * нажать на кнопку "Показать"
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение        |
      | Номер   | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |
    * в блоке "Параметры заявки => Запрошенные параметры" нажать на кнопку "Идентифицировать клиента"
    * дождаться отображения страницы "Идентификация клиента"
    * нажать на кнопку "Поиск клиента"
    * дождаться отображения страницы "Поиск клиента"
    * в блоке "Результаты" нажать на кнопку "Выбрать"
    * дождаться отображения страницы "Сведения о Заёмщике"
    * нажать на кнопку "Связать с кредитной заявкой"
    * дождаться отображения страницы "Прикрепление согласий Заёмщика"
    * примечание: далее работаем в контексте блока "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ"
    * нажать на "Односторонняя печать" и скачать файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * нажать на "Прикрепить файл" и выбрать загруженный файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение |
      | ссылка | Файл     | содержит  | PDF      |
    * примечание: далее работаем в контексте текущей страницы
    * нажать на кнопку "Продолжить"
    * дождаться отображения страницы "Редактирование клиента"
    * нажать на "Печать заявления на изменение сведений (Односторонняя печать)" и скачать файл "Заявление на изменение сведений.pdf"
    * нажать на кнопку "Сохранить"
#    * выполнить сценарий "Найти клиента"
#    * в списке "Меню вкладок" выбрать "Кредитные заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитные заявки | отображается |
      | таблица  | Кредитные заявки | отображается |
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец      | Значение        |
      | Номер заявки | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 3                | открыта      |
#      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |
    * в блоке "Параметры заявки => Запрошенные параметры" нажать на кнопку "Продолжить"
    * заполнить поля формы в блоке "Параметры заявки => Запрошенные параметры (редактирование)" значениями:
      | Тип               | Название                         | Значение               |
      | выпадающий список | Сотрудник, осуществивший продажу | 00500001 Осминин Е. С. |
    * в списке "Меню вкладок страницы" выбрать "Заемщик"
    * примечание: далее работаем в контексте блока "Заемщик"
    * заполнить поля формы в блоке "Персональные данные" значениями:
      | Тип               | Название                                               | Значение          |
      | выпадающий список | Образование                                            | Высшее            |
      | поле              | СНИЛС                                                  | 78460631327       |
      | радио-кнопка      | Военный билет                                          | да                |
      | выпадающий список | Семейное положение                                     | Холост/Не замужем |
      | поле              | Кол-во детей до 18 лет                                 | 0                 |
      | поле              | Кол-во иных иждивенцев, за исключением детей до 18 лет | 0                 |
    * сделать снимок страницы
    * в списке "Меню вкладок подраздела" выбрать "Работа"
    * заполнить поля формы в блоке "Работа" значениями:
      | Тип               | Название                     | Значение                        |
      | выпадающий список | Информация о трудоустройстве | Безработный/Временно не работаю |
    * заполнить поля формы в блоке "Работа => Общий стаж за последние 5 лет" значениями:
      | Тип  | Название | Значение |
      | поле | лет      | 2        |
      | поле | мес.     | 10       |
    * сделать снимок страницы
    * в списке "Меню вкладок подраздела" выбрать "Доходы и расходы"
    * заполнить поля формы в блоке "Доходы и расходы => Доходы" значениями:
      | Тип               | Название                                              | Значение       |
      | выпадающий список | Способ подтверждения дохода по основному месту работы | Не подтвержден |
      | поле              | Основная зарплата                                     | 50000          |
      | выпадающий список | Способ подтверждения дополнительного дохода           | Не подтвержден |
      | выпадающий список | Способ подтверждения пенсионных доходов               | Не подтвержден |
      | выпадающий список | Способ подтверждения иных доходов                     | Не подтвержден |
    * заполнить поля формы в блоке "Доходы и расходы => Расходы" значениями:
      | Тип  | Название             | Значение |
      | поле | Обязательные выплаты | 4321     |
    * сделать снимок страницы
    * в списке "Меню вкладок подраздела" выбрать "Иная информация"
    * заполнить поля формы в блоке "Иная информация" значениями:
      | Тип               | Название                    | Значение  |
      | выпадающий список | Отношение к воинской службе | Не служил |
    * сделать снимок страницы
    * в блоке "Иная информация" нажать на кнопку "Продолжить"
    * примечание: далее работаем в контексте текущей страницы
    * дождаться выполнения условий:
      | Объект         | Название              | Состояние    |
      | страница       | Кредитная заявка      | отображается |
      | блок элементов | Запрошенные параметры | отображается |
    * сделать снимок страницы
    * подождать 1 минуту
