#language: ru
@002
@002.002

Функционал: [002. Заявка на кредит][002. Через сайт]

  @002.002.001
  Сценарий: 001. Действующий клиент. Короткая анкета. Выдача.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |
    * выполнить сценарий "Кредитная заявка через сайт -> Приём заявки"
    * выполнить сценарий "Кредитная заявка через сайт -> Идентификация клиента"
    * выполнить сценарий "Кредитная заявка через сайт -> Ввод заявки"
    * отправить POST-запрос "efr_SaveApplication" с параметрами:
      | Параметр | Значение |
      | Параметр | Значение |
    * подождать 1 минуту
