#language: ru
@002
@002.002

Функционал: [002. Заявка на кредит][002. Через сайт]

  @002.002.001
  Сценарий: 001. Действующий клиент. Короткая анкета. Выдача.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |
    * отправить POST-запрос "CreateApplicationShortEFR" с параметрами:
      | Параметр                  | Значение                                                  |
      | CanalSales                | ${CreateApplicationShortEFR} -> CanalSales                |
      | CurrentDate               | ${CreateApplicationShortEFR} -> CurrentDate               |
      | Summa                     | ${CreateApplicationShortEFR} -> Summa                     |
      | PeriodLoan                | ${CreateApplicationShortEFR} -> PeriodLoan                |
      | LoanTarget                | ${CreateApplicationShortEFR} -> LoanTarget                |
      | Direction                 | ${CreateApplicationShortEFR} -> Direction                 |
      | IncomeMedium              | ${CreateApplicationShortEFR} -> IncomeMedium              |
      | ProductCode               | ${CreateApplicationShortEFR} -> ProductCode               |
      | CurrencyCode              | ${CreateApplicationShortEFR} -> CurrencyCode              |
      | BranchId                  | ${CreateApplicationShortEFR} -> BranchId                  |
      | LoanId                    | ${CreateApplicationShortEFR} -> LoanId                    |
      | ClientType                | ${CreateApplicationShortEFR} -> ClientType                |
      | IsCheckBKI                | ${CreateApplicationShortEFR} -> IsCheckBKI                |
      | IsConsentAssignmentClaims | ${CreateApplicationShortEFR} -> IsConsentAssignmentClaims |
      | IsProcessPersonalData     | ${CreateApplicationShortEFR} -> IsProcessPersonalData     |
      | IsRegistrationLocation    | ${CreateApplicationShortEFR} -> IsRegistrationLocation    |
      | IsReliableCustomer        | ${CreateApplicationShortEFR} -> IsReliableCustomer        |
      | IsBudgetOrgEmployee       | ${CreateApplicationShortEFR} -> IsBudgetOrgEmployee       |
      | IsSalaryRSHB              | ${CreateApplicationShortEFR} -> IsSalaryRSHB              |
      | IsPensionRSHB             | ${CreateApplicationShortEFR} -> IsPensionRSHB             |
      | ConsentBKIDate            | ${CreateApplicationShortEFR} -> ConsentBKIDate            |
      | IsCheckScore              | ${CreateApplicationShortEFR} -> IsCheckScore              |
      | IsConsentSMSBKI           | ${CreateApplicationShortEFR} -> IsConsentSMSBKI           |
      | BKIHashCode               | ${CreateApplicationShortEFR} -> BKIHashCode               |
      | BKIConsentPeriod          | ${CreateApplicationShortEFR} -> BKIConsentPeriod          |
      | ConsentUserType           | ${CreateApplicationShortEFR} -> ConsentUserType           |
      | StockCode                 | ${CreateApplicationShortEFR} -> StockCode                 |
      | DocumentType              | Паспорт                                                   |
      | docSeries                 | ${Паспорт} -> серия                                       |
      | docNumber                 | ${Паспорт} -> номер                                       |
      | Issued                    | ${Паспорт} -> кем выдан                                   |
      | IssueDate                 | ${Паспорт} -> дата выдачи                                 |
      | SubdivisionCode           | ${Паспорт} -> код подразделения                           |
      | clientLastName            | ${Клиент} -> фамилия                                      |
      | clientFirstName           | ${Клиент} -> имя                                          |
      | clientMiddleName          | ${Клиент} -> отчество                                     |
      | clientBirthDate           | ${Клиент} -> дата рождения                                |
      | clientBirthPlace          | ${Клиент} -> место рождения                               |
      | clientPhone               | ${Клиент} -> телефон                                      |
      | clientEMail               | ${Клиент} -> e-mail                                       |
      | clientRegDate             | ${Клиент} -> дата регистрации                             |
      | clientGender              | ${Клиент} -> пол                                          |
      | residenceIndex            | ${Адрес регистрации} -> индекс                            |
      | residenceDistrict         | ${Адрес регистрации} -> район                             |
      | residenceCity             | ${Адрес регистрации} -> город                             |
      | residenceLocality         | ${Адрес регистрации} -> населенный пункт                  |
      | residenceStreet           | ${Адрес регистрации} -> улица                             |
      | residenceHouse            | ${Адрес регистрации} -> номер дома                        |
      | residenceBuilding         | ${Адрес регистрации} -> строение                          |
      | residenceCorps            | ${Адрес регистрации} -> корпус                            |
      | residenceApartment        | ${Адрес регистрации} -> номер квартиры                    |
      | residenceRegionCode       | ${Адрес регистрации} -> код региона                       |
      | realIndex                 | ${Адрес регистрации} -> индекс                            |
      | realDistrict              | ${Адрес регистрации} -> район                             |
      | realCity                  | ${Адрес регистрации} -> город                             |
      | realLocality              | ${Адрес регистрации} -> населенный пункт                  |
      | realStreet                | ${Адрес регистрации} -> улица                             |
      | realHouse                 | ${Адрес регистрации} -> номер дома                        |
      | realBuilding              | ${Адрес регистрации} -> строение                          |
      | realCorps                 | ${Адрес регистрации} -> корпус                            |
      | realApartment             | ${Адрес регистрации} -> номер квартиры                    |
      | realRegionCode            | ${Адрес регистрации} -> код региона                       |
    * в меню "Главное меню" выбрать "Кредитные заявки"
    * дождаться выполнения условий:
      | Объект   | Название                         | Состояние    |
      | страница | Кредитные заявки (подразделения) | отображается |
    * заполнить поля формы значениями:
      | Тип               | Название           | Значение                |
      | выпадающий список | Канал подачи       | Интернет-сайт           |
      | поле              | Заемщик            | ${Клиент} -> фамилия    |
      | выпадающий список | Продуктовая группа | Потребительский кредит  |
      | выпадающий список | Статус             | Предварительное решение |
    * нажать на кнопку "Показать"
    * дождаться выполнения условий:
      | Объект  | Название         | Состояние    |
      | элемент | Кредитные заявки | отображается |
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение                  |
      | Заемщик | ${Клиент} -> фамилия И.О. |
    * в найденной строке найти и сохранить значения элементов:
      | Объект | Название     | Параметр     |
      | ссылка | Номер заявки | Номер заявки |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |
    * отправить POST-запрос "creditCalcEFR" с параметрами:
      | Параметр     | Значение        |
      | номер заявки | ${Номер заявки} |
    * дождаться отображения действия "Предварительный расчет лимита" на вкладке "История"
    * отправить POST-запрос "creditCalcEFR" с параметрами:
      | Параметр     | Значение        |
      | номер заявки | ${Номер заявки} |
    * дождаться отображения действия "Взятие в работу заявки" на вкладке "История"
    * в списке "Меню вкладок страницы" выбрать "Параметры заявки"
    * закрыть текущую вкладку
    * дождаться выполнения условий:
      | Объект   | Название                         | Состояние    |
      | вкладка  | 1                                | открыта      |
      | страница | Кредитные заявки (подразделения) | отображается |
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение        |
      | Номер   | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |
    * примечание: далее работаем в контексте блока "Параметры заявки"
    * примечание: далее работаем в контексте блока "Запрошенные параметры"
    * нажать на кнопку "Идентифицировать клиента"
    * дождаться отображения страницы "Идентификация клиента"
    * нажать на кнопку "Поиск клиента"
    * дождаться отображения страницы "Поиск клиента"
    * дождаться выполнения условий:
      | Объект         | Название      | Состояние    |
      | страница       | Поиск клиента | отображается |
      | блок элементов | Результаты    | отображается |
    * в блоке "Результаты" нажать на кнопку "Выбрать"
    * дождаться отображения страницы "Сведения о Заёмщике"
    * нажать на кнопку "Связать с кредитной заявкой"
    * дождаться отображения страницы "Прикрепление согласий Заёмщика"
    * примечание: далее работаем в контексте блока "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ"
    * нажать на "Односторонняя печать" и скачать файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * нажать на "Прикрепить файл" и выбрать загруженный файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение |
      | ссылка | Файл     | содержит  | PDF      |
    * примечание: далее работаем в контексте текущей страницы
    * нажать на кнопку "Продолжить"
    * дождаться отображения страницы "Редактирование клиента"
    * нажать на "Печать заявления на изменение сведений (Односторонняя печать)" и скачать файл "Заявление на изменение сведений.pdf"
    * нажать на кнопку "Сохранить"
#    * выполнить сценарий "Найти клиента"
#    * в списке "Меню вкладок" выбрать "Кредитные заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитные заявки | отображается |
      | таблица  | Кредитные заявки | отображается |
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец      | Значение        |
#      | Номер заявки | 444/6300/933411000000 |
      | Номер заявки | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 3                | открыта      |
      | страница | Кредитная заявка | отображается |
    * в блоке "Параметры заявки => Запрошенные параметры" нажать на кнопку "Продолжить"
    * дождаться выполнения условий:
      | Объект         | Название         | Состояние    |
      | блок элементов | Параметры заявки | отображается |
    * примечание: далее работаем в контексте блока "Параметры заявки"
    * дождаться выполнения условий:
      | Объект         | Название                               | Состояние    |
      | блок элементов | Запрошенные параметры (редактирование) | отображается |
    * заполнить поля формы в блоке "Запрошенные параметры (редактирование)" значениями:
      | Тип               | Название                         | Значение               |
      | выпадающий список | Сотрудник, осуществивший продажу | 00500001 Осминин Е. С. |
    * примечание: далее работаем в контексте текущей страницы
    * в списке "Меню вкладок страницы" выбрать "Заемщик"
    * дождаться выполнения условий:
      | Объект         | Название | Состояние    |
      | блок элементов | Заемщик  | отображается |
    * примечание: далее работаем в контексте блока "Заемщик"
    * заполнить поля формы в блоке "Персональные данные" значениями:
      | Тип               | Название                                               | Значение          |
      | выпадающий список | Образование                                            | Высшее            |
      | поле              | СНИЛС                                                  | 78460631327       |
      | радио-кнопка      | Военный билет                                          | да                |
      | выпадающий список | Семейное положение                                     | Холост/Не замужем |
      | поле              | Кол-во детей до 18 лет                                 | 0                 |
      | поле              | Кол-во иных иждивенцев, за исключением детей до 18 лет | 0                 |
    * сделать снимок страницы
    * подождать 1 минуту
