#language: ru
Функционал: Кредитная заявка

  Сценарий: Поиск и открытие заявки клиента
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
    | Столбец      | Значение        |
    | Номер заявки | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
    | Объект   | Название         | Состояние    |
    | вкладка  | 3                | открыта      |
    | страница | Кредитная заявка | отображается |

  Сценарий: Удаление всех кредитных заявок клиента
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |
