#language: ru
Функционал: Кредитная заявка

  Сценарий: Поиск и открытие заявки клиента
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец      | Значение        |
      | Номер заявки | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться отображения страницы "Кредитная заявка" в новой вкладке

  Сценарий: Удаление всех кредитных заявок клиента
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |

  Сценарий: Поиск заявки на форме заявок подразделения
    * в меню "Главное меню" выбрать "Кредитные заявки"
    * дождаться отображения страницы "Кредитные заявки (подразделения)"
    * заполнить поля формы значениями:
      | Тип               | Название           | Значение              |
      | выпадающий список | Канал подачи       | ${Канал подачи}       |
      | поле              | Заемщик            | ${Клиент} -> фамилия  |
      | выпадающий список | Продуктовая группа | ${Продуктовая группа} |
      | выпадающий список | Статус             | ${Статус}             |
    * нажать на кнопку "Показать"
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение        |
      | Номер   | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться отображения страницы "Кредитная заявка" в новой вкладке

  Сценарий: Ожидание обработки заявки
    * выполнять сценарий "Кредитная заявка -> Получение истории обработки заявки" до выполнения условий:
      | Объект   | Название              | Состояние | Значение           | Ожидание  |
      | параметр | ${Название параметра} | содержит  | ${Ожидаемый текст} | 2 секунды |

  Сценарий: Получение истории обработки заявки
    * отправить GET-запрос "История кредитной заявки" с параметрами:
      | Параметр | Значение                                                            |
      | url      | ${Адрес стенда}/efrapi/credit/claim/${Идентификатор заявки}/history |
    * разобрать ответ запроса "История кредитной заявки", сохранив значения в параметрах:
      | Параметр           | Регулярное выражение    |
      | Ожидаемое значение | ${Регулярное выражение} |

  Сценарий: Перевод заявки на следующий шаг обработки
    * нажать на кнопку "Продолжить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * примечание: далее работаем в контексте текущей страницы
