#language: ru
Функционал: Кредитная заявка через сайт

  Сценарий: Приём заявки
    * отправить POST-запрос "CreateApplicationShortEFR" с параметрами:
      | Параметр                  | Значение                                                  |
      | CanalSales                | ${CreateApplicationShortEFR} -> CanalSales                |
      | CurrentDate               | ${CreateApplicationShortEFR} -> CurrentDate               |
      | Summa                     | ${CreateApplicationShortEFR} -> Summa                     |
      | PeriodLoan                | ${CreateApplicationShortEFR} -> PeriodLoan                |
      | LoanTarget                | ${CreateApplicationShortEFR} -> LoanTarget                |
      | Direction                 | ${CreateApplicationShortEFR} -> Direction                 |
      | IncomeMedium              | ${CreateApplicationShortEFR} -> IncomeMedium              |
      | ProductCode               | ${CreateApplicationShortEFR} -> ProductCode               |
      | CurrencyCode              | ${CreateApplicationShortEFR} -> CurrencyCode              |
      | BranchId                  | ${CreateApplicationShortEFR} -> BranchId                  |
      | LoanId                    | ${CreateApplicationShortEFR} -> LoanId                    |
      | ClientType                | ${CreateApplicationShortEFR} -> ClientType                |
      | IsCheckBKI                | ${CreateApplicationShortEFR} -> IsCheckBKI                |
      | IsConsentAssignmentClaims | ${CreateApplicationShortEFR} -> IsConsentAssignmentClaims |
      | IsProcessPersonalData     | ${CreateApplicationShortEFR} -> IsProcessPersonalData     |
      | IsRegistrationLocation    | ${CreateApplicationShortEFR} -> IsRegistrationLocation    |
      | IsReliableCustomer        | ${CreateApplicationShortEFR} -> IsReliableCustomer        |
      | IsBudgetOrgEmployee       | ${CreateApplicationShortEFR} -> IsBudgetOrgEmployee       |
      | IsSalaryRSHB              | ${CreateApplicationShortEFR} -> IsSalaryRSHB              |
      | IsPensionRSHB             | ${CreateApplicationShortEFR} -> IsPensionRSHB             |
      | ConsentBKIDate            | ${CreateApplicationShortEFR} -> ConsentBKIDate            |
      | IsCheckScore              | ${CreateApplicationShortEFR} -> IsCheckScore              |
      | IsConsentSMSBKI           | ${CreateApplicationShortEFR} -> IsConsentSMSBKI           |
      | BKIHashCode               | ${CreateApplicationShortEFR} -> BKIHashCode               |
      | BKIConsentPeriod          | ${CreateApplicationShortEFR} -> BKIConsentPeriod          |
      | ConsentUserType           | ${CreateApplicationShortEFR} -> ConsentUserType           |
      | StockCode                 | ${CreateApplicationShortEFR} -> StockCode                 |
      | DocumentType              | Паспорт                                                   |
      | docSeries                 | ${Паспорт} -> серия                                       |
      | docNumber                 | ${Паспорт} -> номер                                       |
      | Issued                    | ${Паспорт} -> кем выдан                                   |
      | IssueDate                 | ${Паспорт} -> дата выдачи                                 |
      | SubdivisionCode           | ${Паспорт} -> код подразделения                           |
      | clientLastName            | ${Клиент} -> фамилия                                      |
      | clientFirstName           | ${Клиент} -> имя                                          |
      | clientMiddleName          | ${Клиент} -> отчество                                     |
      | clientBirthDate           | ${Клиент} -> дата рождения                                |
      | clientBirthPlace          | ${Клиент} -> место рождения                               |
      | clientPhone               | ${Клиент} -> телефон                                      |
      | clientEMail               | ${Клиент} -> e-mail                                       |
      | clientRegDate             | ${Клиент} -> дата регистрации                             |
      | clientGender              | ${Клиент} -> пол                                          |
      | residenceIndex            | ${Адрес регистрации} -> индекс                            |
      | residenceDistrict         | ${Адрес регистрации} -> район                             |
      | residenceCity             | ${Адрес регистрации} -> город                             |
      | residenceLocality         | ${Адрес регистрации} -> населенный пункт                  |
      | residenceStreet           | ${Адрес регистрации} -> улица                             |
      | residenceHouse            | ${Адрес регистрации} -> номер дома                        |
      | residenceBuilding         | ${Адрес регистрации} -> строение                          |
      | residenceCorps            | ${Адрес регистрации} -> корпус                            |
      | residenceApartment        | ${Адрес регистрации} -> номер квартиры                    |
      | residenceRegionCode       | ${Адрес регистрации} -> код региона                       |
      | realIndex                 | ${Адрес регистрации} -> индекс                            |
      | realDistrict              | ${Адрес регистрации} -> район                             |
      | realCity                  | ${Адрес регистрации} -> город                             |
      | realLocality              | ${Адрес регистрации} -> населенный пункт                  |
      | realStreet                | ${Адрес регистрации} -> улица                             |
      | realHouse                 | ${Адрес регистрации} -> номер дома                        |
      | realBuilding              | ${Адрес регистрации} -> строение                          |
      | realCorps                 | ${Адрес регистрации} -> корпус                            |
      | realApartment             | ${Адрес регистрации} -> номер квартиры                    |
      | realRegionCode            | ${Адрес регистрации} -> код региона                       |
    * разобрать ответ запроса "CreateApplicationShortEFR", сохранив значения в параметрах:
      | Параметр             | Регулярное выражение                     |
      | Номер заявки         | LoanId.+?ObjectId>(.+?)<.+ObjectId>      |
      | Идентификатор заявки | ExternalId.+?ObjectId>(\d+?)<.+ObjectId> |
    * отправить POST-запрос "creditCalcEFR" с параметрами:
      | Параметр     | Значение        |
      | номер заявки | ${Номер заявки} |
    * выполнить сценарий "Кредитная заявка через сайт -> Ожидание обработки заявки" с параметрами:
      | Параметр           | Значение                      |
      | Название параметра | Ожидаемое значение            |
      | Ожидаемый текст    | Предварительный расчет лимита |
    * отправить POST-запрос "creditCalcEFR" с параметрами:
      | Параметр     | Значение        |
      | номер заявки | ${Номер заявки} |
    * выполнить сценарий "Кредитная заявка через сайт -> Ожидание обработки заявки" с параметрами:
      | Параметр           | Значение                                     |
      | Название параметра | Результат запроса 'История кредитной заявки' |
      | Ожидаемый текст    | Расчетная сумма кредита равна 50000          |

  Сценарий: Поиск заявки на форме заявок подразделения
    * в меню "Главное меню" выбрать "Кредитные заявки"
    * дождаться отображения страницы "Кредитные заявки (подразделения)"
    * заполнить поля формы значениями:
      | Тип               | Название           | Значение              |
      | выпадающий список | Канал подачи       | ${Канал подачи}       |
      | поле              | Заемщик            | ${Клиент} -> фамилия  |
      | выпадающий список | Продуктовая группа | ${Продуктовая группа} |
      | выпадающий список | Статус             | ${Статус}             |
    * нажать на кнопку "Показать"
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение        |
      | Номер   | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |

  Сценарий: Идентификация клиента
    * выполнить сценарий "Поиск заявки на форме заявок подразделения" с параметрами:
      | Параметр           | Значение                |
      | Канал подачи       | Интернет-сайт           |
      | Продуктовая группа | Потребительский кредит  |
      | Статус             | Предварительное решение |
    * нажать на кнопку "Идентифицировать клиента"
    * дождаться отображения страницы "Идентификация клиента"
    * нажать на кнопку "Поиск клиента"
    * дождаться отображения страницы "Поиск клиента"
    * в блоке "Результаты" нажать на кнопку "Выбрать"
    * дождаться отображения страницы "Сведения о Заёмщике"
    * нажать на кнопку "Связать с кредитной заявкой"
    * дождаться отображения страницы "Прикрепление согласий Заёмщика"
    * нажать на "Односторонняя печать" и скачать файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * нажать на "Прикрепить файл" и выбрать загруженный файл "Согласие на обработку персональных данных и получение кредитных отчетов из БКИ.pdf"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение |
      | ссылка | Файл     | содержит  | PDF      |
    * нажать на кнопку "Продолжить"
    * дождаться отображения страницы "Редактирование клиента"
    * нажать на "Печать заявления на изменение сведений (Односторонняя печать)" и скачать файл "Заявление на изменение сведений.pdf"
    * нажать на кнопку "Сохранить"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитные заявки | отображается |
      | таблица  | Кредитные заявки | отображается |

  Сценарий: Ввод заявки
    * выполнить сценарий "Кредитная заявка -> Поиск и открытие заявки клиента"
    * выполнить сценарий "Заполнение раздела 'Запрошенные параметры'"
    * в списке "Меню вкладок страницы" выбрать "Заемщик"
    * примечание: далее работаем в контексте блока "Заемщик"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Персональные данные'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Работа'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Доходы и расходы'"
    * выполнить сценарий "Кредитная заявка через сайт -> Заполнение подраздела 'Иная информация'"
    * выполнить сценарий "Кредитная заявка через сайт -> Перевод заявки на следующий шаг обработки"
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копий документов"
    * выполнить сценарий "Кредитная заявка через сайт -> Перевод заявки на следующий шаг обработки"
    * дождаться выполнения условий "Статус заявки - Анализ и принятие решения":
      | Объект | Название | Состояние | Значение                  |
      | текст  | Статус   | содержит  | Анализ и принятие решения |

  Сценарий: Заполнение раздела 'Запрошенные параметры'
    * примечание: далее работаем в контексте блока "Параметры заявки"
    * нажать на кнопку "Продолжить"
    * заполнить поля формы в блоке "Запрошенные параметры (редактирование)" значениями:
      | Тип               | Название                               | Значение                                   |
      | выпадающий список | Сотрудник, осуществивший продажу       | 00500001 Осминин Е. С.                     |
      | переключатель     | Личное страхование Заемщика            | да                                         |
      | выпадающий список | Страховая программа                    | Страхование жизни и здоровья, телемедицина |
      | поле              | Страховая плата                        | 10000                                      |
      | поле              | Вознаграждения Банку                   | 1000                                       |
      | поле              | Страховая премия страховой организации | 2000                                       |
    * примечание: далее работаем в контексте текущей страницы

  Сценарий: Заполнение подраздела 'Персональные данные'
    * заполнить поля формы в блоке "Персональные данные" значениями:
      | Тип               | Название                                               | Значение          |
      | выпадающий список | Образование                                            | Высшее            |
      | поле              | СНИЛС                                                  | 78460631327       |
      | радио-кнопка      | Военный билет                                          | нет               |
      | выпадающий список | Тип жилья                                              | Собственность     |
      | выпадающий список | Семейное положение                                     | Холост/Не замужем |
      | поле              | Кол-во детей до 18 лет                                 | 1                 |
      | поле              | Кол-во иных иждивенцев, за исключением детей до 18 лет | 0                 |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Работа'
    * в списке "Меню вкладок подраздела" выбрать "Работа"
    * заполнить поля формы в блоке "Работа" значениями:
      | Тип               | Название                     | Значение                        |
      | выпадающий список | Информация о трудоустройстве | Безработный/Временно не работаю |
    * заполнить поля формы в блоке "Работа -> Общий стаж за последние 5 лет" значениями:
      | Тип  | Название | Значение |
      | поле | лет      | 5        |
      | поле | мес.     | 0        |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Доходы и расходы'
    * в списке "Меню вкладок подраздела" выбрать "Доходы и расходы"
    * заполнить поля формы в блоке "Доходы и расходы -> Доходы" значениями:
      | Тип               | Название                                              | Значение       |
      | выпадающий список | Способ подтверждения дохода по основному месту работы | Не подтвержден |
      | поле              | Основная зарплата                                     | 100000         |
      | выпадающий список | Способ подтверждения дополнительного дохода           | Не подтвержден |
      | поле              | Доход по совместительству                             | 12000          |
      | выпадающий список | Способ подтверждения пенсионных доходов               | Не подтвержден |
      | поле              | Пенсия                                                | 22000          |
      | выпадающий список | Способ подтверждения иных доходов                     | Не подтвержден |
      | поле              | Иные доходы                                           | 6000           |
    * заполнить поля формы в блоке "Доходы и расходы -> Расходы" значениями:
      | Тип  | Название             | Значение |
      | поле | Обязательные выплаты | 30000    |
      | поле | Алименты             | 25000    |
    * сделать снимок страницы

  Сценарий: Заполнение подраздела 'Иная информация'
    * в списке "Меню вкладок подраздела" выбрать "Иная информация"
    * заполнить поля формы в блоке "Иная информация" значениями:
      | Тип               | Название                    | Значение        |
      | выпадающий список | Отношение к воинской службе | Отслужил/Запаса |
    * сделать снимок страницы
    * нажать на кнопку "Продолжить"
    * примечание: выходим из текущего контекста и работаем в контексте блока "Параметры заявки"
    * дождаться отображения блока "Запрошенные параметры"

  Сценарий: Перевод заявки на следующий шаг обработки
    * нажать на кнопку "Продолжить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * примечание: далее работаем в контексте текущей страницы

  Сценарий: Прикрепление скан-копии документа
    * служебный шаг: повторять действия до выполнения условий "Отображается всплывающее окно"
    * нажать на кнопку "Добавить"
    * дождаться выполнения условий "Отображается всплывающее окно":
      | Объект           | Название                         | Состояние    | Ожидание  |
      | всплывающее окно | Приложение скан-копии документов | отображается | 2 секунды |
    * в выпадающем списке "Тип документа" выбрать "${Тип документа}"
    * нажать на "Прикрепить файл" и выбрать файл "${Прикрепляемый файл}"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение     |
      | ссылка | Файл     | содержит  | ${Тип файла} |
    * нажать на кнопку "Добавить"
    * дождаться закрытия всплывающего окна "Приложение скан-копии документов"
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение         |
      | Документ | ${Тип документа} |

  Сценарий: Прикрепление скан-копий документов
    * примечание: далее работаем в контексте блока "Документы"
    * нажать на "Печать анкеты заявления (односторонняя)" и скачать файл "Анкета-заявление на предоставление кредита.pdf"
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                          |
      | Тип документа      | Анкета                                            |
      | Прикрепляемый файл | ${Анкета-заявление на предоставление кредита.pdf} |
      | Тип файла          | PDF                                               |
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                                |
      | Тип документа      | Фото всех участников сделки                             |
      | Прикрепляемый файл | ${Скан-копии документов} -> Фото всех участников сделки |
      | Тип файла          | JPG                                                     |
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии документа" с параметрами:
      | Параметр           | Значение                                                |
      | Тип документа      | Кредитное дело 1                                        |
      | Прикрепляемый файл | ${Скан-копии документов} -> Фото всех участников сделки |
      | Тип файла          | JPG                                                     |
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение                    |
      | Документ | Фото всех участников сделки |
    * сделать снимок страницы

  Сценарий: Ожидание обработки заявки
    * служебный шаг: повторять действия до выполнения условий "Содержимое результата GET-запроса содержит ожидаемый текст"
    * отправить GET-запрос "История кредитной заявки" с параметрами:
      | Параметр | Значение                                                            |
      | url      | ${Адрес стенда}/efrapi/credit/claim/${Идентификатор заявки}/history |
    * разобрать ответ запроса "История кредитной заявки", сохранив значения в параметрах:
      | Параметр           | Регулярное выражение                                                                         |
      | Ожидаемое значение | edit-claim-data.+?preliminary-limit-calc.+?(Предварительный расчет лимита).+?edit-claim-data |
    * дождаться выполнения условий "Содержимое результата GET-запроса содержит ожидаемый текст":
      | Объект   | Название              | Состояние | Значение           | Ожидание  |
      | параметр | ${Название параметра} | содержит  | ${Ожидаемый текст} | 2 секунды |

  Сценарий: Анализ и принятие решения
    * отправить POST-запрос "efr_SaveApplication" с параметрами:
      | Параметр          | Значение                                    |
      | ApplicationDate   | ${CreateApplicationShortEFR} -> CurrentDate |
      | ApplicationNumber | ${Номер заявки}                             |
    * служебный шаг: повторять действия до выполнения условий "Статус заявки - Ожидание клиента на сделку"
    * обновить страницу
    * дождаться выполнения условий "Статус заявки - Ожидание клиента на сделку":
      | Объект   | Название         | Состояние    | Значение                   | Ожидание  |
      | страница | Кредитная заявка | отображается |                            | 30 секунд |
      | текст    | Статус           | содержит     | Ожидание клиента на сделку | 2 секунды |
    * сделать снимок страницы

  Сценарий: Сверка
    * нажать на кнопку "Создать КОД"
    * дождаться отображения блока "Проверка сведений о доходах"
    * примечание: далее работаем в контексте блока "Проверка сведений о доходах"
    * заполнить поля формы значениями:
      | Тип           | Блок                 | Название                                             | Значение |
      | переключатель | Основной доход       | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Пенсионный доход     | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Дополнительный доход | Сведения о доходе соответствуют заявленным в заявке? | да       |
      | переключатель | Иные доходы          | Сведения о доходе соответствуют заявленным в заявке? | да       |
    * нажать на кнопку "Продолжить"
    * примечание: выходим из текущего контекста и работаем в контексте блока "Визуальная оценка"
    * заполнить поля формы значениями:
      | Тип           | Название                                                          | Значение |
      | переключатель | У клиента имеются признаки алкогольного/наркотического опьянения? | нет      |
      | переключатель | У клиента наблюдаются явные отклонения в психическом состоянии?   | нет      |
      | переключатель | У клиента имеются видимые отклонения в физическом состоянии?      | нет      |
      | переключатель | У клиента имеются признаки судимости?                             | нет      |
      | переключатель | Ведет ли клиент себя неадекватно?                                 | нет      |
      | переключатель | Выглядит ли клиент неопрятно?                                     | нет      |
      | переключатель | Клиента сопровождают?                                             | нет      |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Визуальная оценка"
    * нажать на кнопку "Продолжить"
    * примечание: выходим из текущего контекста и работаем в контексте блока "Документы"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Документы"
    * нажать на кнопку "Продолжить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * примечание: выходим из текущего контекста и работаем в контексте блока "Параметры заявки"
    * дождаться отображения блока "Решение банка"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * подождать 1 минуту
