#language: ru
Функционал: Кредитная заявка

  Сценарий: Поиск и открытие заявки клиента
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец      | Значение        |
      | Номер заявки | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться отображения страницы "Кредитная заявка" в новой вкладке

  Сценарий: Удаление всех кредитных заявок клиента
    * в базе данных "credit_db" выполнить sql-скрипт из файла "drop_credit_claims_by_client_doc_number.sql" с параметрами:
      | Параметр       | Значение            |
      | номер паспорта | ${Паспорт} -> номер |

  Сценарий: Поиск заявки на форме заявок подразделения
    * в меню "Главное меню" выбрать "Кредитные заявки"
    * дождаться отображения страницы "Кредитные заявки (подразделения)"
    * заполнить поля формы значениями:
      | Тип               | Название           | Значение              |
      | выпадающий список | Канал подачи       | ${Канал подачи}       |
      | поле              | Заемщик            | ${Клиент} -> фамилия  |
      | выпадающий список | Продуктовая группа | ${Продуктовая группа} |
      | выпадающий список | Статус             | ${Статус}             |
    * нажать на кнопку "Показать"
    * в таблице "Кредитные заявки" найти строку, соответствующую условиям:
      | Столбец | Значение        |
      | Номер   | ${Номер заявки} |
    * в найденной строке нажать на "Номер заявки"
    * дождаться отображения страницы "Кредитная заявка" в новой вкладке

  Сценарий: Ожидание обработки заявки
    * выполнять сценарий "Кредитная заявка -> Получение истории обработки заявки" до выполнения условий:
      | Объект   | Название              | Состояние | Значение           | Ожидание  |
      | параметр | ${Название параметра} | содержит  | ${Ожидаемый текст} | 2 секунды |

  Сценарий: Получение истории обработки заявки
    * отправить GET-запрос "История кредитной заявки" с параметрами:
      | Параметр | Значение                                                            |
      | url      | ${Адрес стенда}/efrapi/credit/claim/${Идентификатор заявки}/history |
    * разобрать ответ запроса "История кредитной заявки", сохранив значения в параметрах:
      | Параметр           | Регулярное выражение    |
      | Ожидаемое значение | ${Регулярное выражение} |

  Сценарий: Перевод заявки на следующий шаг обработки
    * нажать на кнопку "Продолжить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * примечание: далее работаем в контексте текущей страницы

  Сценарий: Прикрепление скан-копии документа
    * служебный шаг: повторять действия до выполнения условий "Отображается всплывающее окно"
    * нажать на кнопку "Добавить"
    * дождаться выполнения условий "Отображается всплывающее окно":
      | Объект           | Название                         | Состояние    | Ожидание  |
      | всплывающее окно | Приложение скан-копии документов | отображается | 2 секунды |
    * в выпадающем списке "Тип документа" выбрать "${Тип документа}"
    * нажать на "Прикрепить файл" и выбрать файл "${Прикрепляемый файл}"
    * дождаться выполнения условий:
      | Объект | Название | Состояние | Значение     |
      | ссылка | Файл     | содержит  | ${Тип файла} |
    * нажать на кнопку "Добавить"
    * дождаться закрытия всплывающего окна "Приложение скан-копии документов"
    * примечание: далее работаем в контексте блока "Документы"
    * в таблице "Документы" дождаться появления строки, соответствующей условиям:
      | Столбец  | Значение         |
      | Документ | ${Тип документа} |

  Сценарий: Подтверждение документов работником мидл-офиса
    * в меню "Главное меню" выбрать "Задачи"
    * дождаться отображения страницы "Задачи" в новой вкладке
    * примечание: далее работаем в контексте блока "Все задачи"
    * в таблице "Все задачи" найти строку, соответствующую условиям:
      | Столбец | Значение             |
      | ПРОЦЕСС | ${Поиск по процессу} |
      | КЛИЕНТ  | ${Поиск по клиенту}  |
      | ЗАДАЧА  | ${Поиск по задаче}   |
    * в найденной строке нажать на "Взять и исполнить"
    * дождаться отображения страницы "Кредитная заявка"
    * дождаться отображения блока "Параметры заявки -> ${Ожидаемый раздел}"
    * примечание: далее работаем в контексте блока "${Ожидаемый раздел}"
    * нажать на кнопку "Подтвердить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Да"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * примечание: далее работаем в контексте текущей страницы


  Сценарий: Ожидание смены статуса заявки
    * служебный шаг: повторять действия до выполнения условий "Статус заявки: ${Статус}"
    * обновить страницу
    * в таблице "Кредитные заявки" дождаться появления строки, соответствующей условиям:
      | Столбец      | Значение        |
      | Номер заявки | ${Номер заявки} |
      | Статус       | ${Статус}       |
