#language: ru
Функционал: КЗ через сайт. Полная анкета

  Сценарий: Выдача кредита
    * выполнить сценарий "Кредитная заявка через сайт -> Прохождение биоверификации"
    * выполнить сценарий "КЗ через сайт. Полная анкета -> Подтверждение параметров сделки"
    * выполнить сценарий "Кредитная заявка через сайт -> Печать и подписание КОД"
    * выполнить сценарий "Кредитная заявка через сайт -> Прикрепление скан-копии КОД"
    * выполнить сценарий "Кредитная заявка через сайт -> Подтверждение работником мидл-офиса"
    * выполнить сценарий "Кредитная заявка через сайт -> Выдача"

  Сценарий: Подтверждение параметров сделки
    * нажать на кнопку "Задать параметры выдачи"
    * дождаться выполнения условий "Статус заявки: Подготовка КОД":
      | Объект         | Название         | Состояние    | Значение       |
      | текст          | Статус           | содержит     | Подготовка КОД |
      | блок элементов | Параметры выдачи | отображается |                |
    * дождаться отображения блока "Параметры выдачи"
    * заполнить поля формы в блоке "Параметры выдачи" значениями:
      | Тип               | Название       | Значение                |
      | поле              | Сумма кредита  | 120000                  |
      | выпадающий список | День платежа   | 5 числа месяца          |
      | выпадающий список | Форма расчетов | Выдача на счёт          |
      | выпадающий список | Счет           | 408 17 810 163000000224 |
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Параметры выдачи"
    * нажать на кнопку "Оформить"
    * дождаться отображения блока "Параметры заявки -> Запрошенные параметры"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Запрошенные параметры"
