#language: ru
Функционал: КЗ через сайт. Полная анкета

  Сценарий: Сверка
    * выполнить сценарий "Кредитная заявка -> Поиск и открытие заявки клиента"
    * выполнить сценарий "Кредитная заявка через сайт -> Создание КОД"
    * выполнить сценарий "Кредитная заявка -> Прикрепление скан-копий документов"
    * дождаться отображения блока "Параметры заявки -> Решение банка"
    * сделать снимок страницы и сохранить, как "Кредитная заявка. Решение банка"
    * закрыть текущую вкладку
    * выполнить сценарий "Кредитная заявка -> Контрольная сверка документов мидл-офисом"

