#language: ru
Функционал: Анкета клиента

  Сценарий: Открыть форму создания клиента
    * дождаться отображения страницы "Поиск клиента"
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * дождаться выполнения условий:
      | Объект  | Название    | Состояние    |
      | элемент | Уведомление | отображается |
    * служебный шаг: повторять действия до выполнения условий
    * нажать на кнопку "Новый клиент"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    | Ожидание |
      | страница | Создание клиента | отображается | 5 секунд |

  Сценарий: Заполнить обязательные поля анкеты с полной идентификацией
    * нажать на кнопку "Полная идентификация"
    * заполнить поля формы в блоке "Общие сведения" значениями:
      | Тип          | Название                  | Значение                           |
      | поле         | Фамилия                   | ${Общие сведения} -> фамилия       |
      | поле         | Имя                       | ${Общие сведения} -> имя           |
      | поле         | Фамилия и Имя на латинице | ${Общие сведения} -> на латинице   |
      | дата         | Дата рождения             | ${Общие сведения} -> дата рождения |
      | радио-кнопка | Пол                       | ${Общие сведения} -> пол           |
      | справочник   | Гражданство               | ${Общие сведения} -> гражданство   |
    * заполнить поля формы в блоке "Место рождения" значениями:
      | Тип  | Название       | Значение                            |
      | поле | Место рождения | ${Место рождения} -> место рождения |
    * заполнить поля формы в блоке "Документы => Документ" (1) значениями:
      | Тип  | Название          | Значение                        |
      | поле | Код подразделения | ${Паспорт} -> код подразделения |
      | поле | Кем выдан         | ${Паспорт} -> кем выдан         |
      | поле | Дата выдачи       | ${Паспорт} -> дата выдачи       |
    * примечание: далее работаем в контексте блока "Контакты"
    * ввести в поле "E-mail" значение "${Контакты} -> e-mail"
    * заполнить поля формы в блоке "Телефон" (1) значениями:
      | Тип               | Название       | Значение                      |
      | выпадающий список | Тип телефона   | ${Контакты} -> тип телефона   |
      | поле              | Номер телефона | ${Контакты} -> номер телефона |
    * примечание: выходим из текущего контекста и работаем в контексте блока "Адреса"
    * в блоке "Адрес регистрации" нажать на поле "Адрес"
    * дождаться отображения страницы "Обратите внимание"
    * нажать на кнопку "Продолжить без верификации"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * заполнить поля формы в блоке "Адрес регистрации" значениями:
      | Тип               | Название               | Значение                                       |
      | справочник        | Страна                 | ${Адрес регистрации} -> страна                 |
      | поиск по значению | Адрес                  | ${Адрес регистрации} -> адрес                  |
      | поиск по значению | Регион                 | ${Адрес регистрации} -> регион                 |
      | поле              | Город                  | ${Адрес регистрации} -> город                  |
      | поле              | Улица                  | ${Адрес регистрации} -> улица                  |
      | поле              | Номер дома             | ${Адрес регистрации} -> номер дома             |
      | поле              | Индекс                 | ${Адрес регистрации} -> индекс                 |
      | дата              | Период регистрации (с) | ${Адрес регистрации} -> период регистрации (с) |
    * в блоке "Адрес фактического проживания" установить чекбокс "Совпадает с адресом регистрации"
    * в блоке "Почтовый адрес" установить чекбокс "Совпадает с адресом регистрации"
    * примечание: выходим из контекста блока "Адреса"
    * ввести в поле "Кодовое слово" значение "Автотест"