#language: ru
Функционал: Выбор значения из справочника

  Сценарий: Выбрать страну
    * дождаться отображения всплывающего окна "Выберите страну"
    * ввести в поле "Название" значение "${Страна}"
    * нажать на кнопку "Показать"
    * в списке "Значения справочника" выбрать значение "${Страна}"
    * дождаться выполнения условий:
      | Объект   | Название            | Состояние       |
      | страница | Выберите страну     | не отображается |
      | страница | ${Текущая страница} | отображается    |

  Сценарий: Выбрать субъект РФ
    * дождаться отображения всплывающего окна "Субъекты РФ"
    * ввести в поле "Наименование" значение "${Субъект РФ}"
    * нажать на кнопку "Показать"
    * в списке "Значения справочника" выбрать значение "${Субъект РФ}"
    * дождаться выполнения условий:
      | Объект   | Название            | Состояние       |
      | страница | Субъекты РФ         | не отображается |
      | страница | ${Текущая страница} | отображается    |
