#language: ru
Функционал: Фрагменты

  Сценарий: Открыть кредитную заявку
    * в списке "Меню вкладок" выбрать "Кредитные заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | страница | Кредитные заявки | отображается |
      | таблица  | Кредитные заявки | отображается |
    * в таблице "Кредитные заявки" найти строку (с обработанной заявкой), соответствующую условиям:
      | Столбец            | Условие  | Значение              |
      | Продуктовая группа | содержит | ${Продуктовая группа} |
      | Статус             | содержит | ${Статус}             |
    * в строке (с обработанной заявкой) найти и сохранить значения элементов:
      | Объект  | Название      |
      | столбец | Дата создания |
      | ссылка  | Номер заявки  |
    * в строке (с обработанной заявкой) нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |

