#language: ru
Функционал: Фрагменты

  Сценарий: Войти в ЕФР
    * открыть браузер
    * перейти по ссылке "${Адрес стартовой страницы}"
    * дождаться отображения страницы "Вход в приложение"
    * заполнить поля формы значениями:
      | Тип  | Название         | Значение                  |
      | поле | Имя пользователя | ${Пользователь} -> логин  |
      | поле | Пароль           | ${Пользователь} -> пароль |
    * нажать на кнопку "Войти"
    * дождаться отображения страницы "Поиск клиента"

  Сценарий: Найти клиента
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * дождаться отображения страницы "Продукты клиента"

  Сценарий: Открыть кредитную заявку
    * в списке "Меню вкладок" выбрать "Кредитные заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | страница | Кредитные заявки | отображается |
      | таблица  | Кредитные заявки | отображается |
    * в таблице "Кредитные заявки" найти строку (с обработанной заявкой), соответствующую условиям:
      | Столбец            | Условие  | Значение              |
      | Продуктовая группа | содержит | ${Продуктовая группа} |
      | Статус             | содержит | ${Статус}             |
    * в строке (с обработанной заявкой) найти и сохранить значения элементов:
      | Объект  | Название      |
      | столбец | Дата создания |
      | ссылка  | Номер заявки  |
    * в строке (с обработанной заявкой) нажать на "Номер заявки"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    |
      | вкладка  | 2                | открыта      |
      | страница | Кредитная заявка | отображается |

  Сценарий: Сравнить печатную форму с эталоном
    * сформировать шаблон "${Файл}.txt" в соответствии с инструкцией "${Инструкция}"
    * сформировать эталон "${Файл} эталон.pdf" по файлу "${Старый документ}.pdf" и шаблону "${Файл}.txt"
      | Параметр       | Значение        |
      | Номер договора | ${Номер заявки} |
      | ИНН            | ${ИНН}          |
      | Число          | ${Число}        |
      | Месяца         | ${Месяца}       |
      | Год            | ${Год}          |
    * сравнить файл "${Файл}.pdf" с эталоном "${Файл} эталон.pdf"
