#language: ru
@01

Функционал: 01. Анкета клиента

  @01.01
  Сценарий: 01.01 Заполнение анкеты нового клиента. Отмена от сохранения изменений
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * дождаться отображения страницы "Поиск клиента"
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * дождаться выполнения условий:
      | Объект  | Название    | Состояние    |
      | элемент | Уведомление | отображается |
    * нажать на кнопку "Новый клиент"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние       |
      | кнопка   | Новый клиент     | не отображается |
      | страница | Создание клиента | отображается    |
    * нажать на кнопку "Полная идентификация"
    * заполнить поля формы значениями:
      | Тип          | Название                          | Значение                              |
      | файл         | Аватар                            | ${Общие сведения} -> аватар           |
      | поле         | Фамилия                           | ${Общие сведения} -> фамилия          |
      | поле         | Имя                               | ${Общие сведения} -> имя              |
      | поле         | Отчество                          | ${Общие сведения} -> отчество         |
      | поле         | Фамилия и Имя на латинице         | ${Общие сведения} -> на латинице      |
      | дата         | Дата рождения                     | ${Общие сведения} -> дата рождения    |
      | радио-кнопка | Пол                               | ${Общие сведения} -> пол              |
      | справочник   | Гражданство                       | ${Общие сведения} -> гражданство      |
      | поле         | Место рождения                    | ${Место рождения} -> место рождения   |
      | справочник   | Место рождения. Страна            | ${Место рождения} -> страна           |
      | справочник   | Место рождения. Субъект РФ        | ${Место рождения} -> субъект РФ       |
      | поле         | Район (Место рождения)            | ${Место рождения} -> район            |
      | поле         | Населённый пункт (Место рождения) | ${Место рождения} -> населённый пункт |
    * заполнить поля формы в блоке "Документ" (1) значениями:
      | Тип               | Название          | Значение                        |
      | выпадающий список | Тип документа     | ${Паспорт} -> тип документа     |
      | поле              | Серия             | ${Паспорт} -> серия             |
      | поле              | Номер             | ${Паспорт} -> номер             |
      | поле              | Код подразделения | ${Паспорт} -> код подразделения |
      | поле              | Кем выдан         | ${Паспорт} -> кем выдан         |
      | поле              | Дата выдачи       | ${Паспорт} -> дата выдачи       |
      | файл              | Скан документа    | ${Паспорт} -> скан документа    |
    * нажать на кнопку "Добавить документ"
    * заполнить поля формы в блоке "Документ" (2) значениями:
      | Тип               | Название          | Значение                              |
      | выпадающий список | Тип документа     | ${Свидетельство} -> тип документа     |
      | поле              | Серия             | ${Свидетельство} -> серия             |
      | поле              | Номер             | ${Свидетельство} -> номер             |
      | поле              | Кем выдан         | ${Свидетельство} -> кем выдан         |
      | поле              | Дата выдачи       | ${Свидетельство} -> дата выдачи       |
      | переключатель     | Основной документ | ${Свидетельство} -> основной документ |
      | файл              | Скан документа    | ${Свидетельство} -> скан документа    |
    * подождать 30 минут

  @01.02
  Сценарий: 01.02 Отладка сравнения печатных форм
    * подготовить тестовые параметры
    * войти в "ЕФР"
    * выполнить сценарий "Найти клиента"
    * в списке "Меню вкладок" выбрать "Данные клиента"
    * дождаться выполнения условий:
      | Объект   | Название       | Состояние    |
      | страница | Данные клиента | отображается |
    * сохранить значения поля "ИНН", как "ИНН"
    * выполнить сценарий "Открыть кредитную заявку" с параметрами:
      | Параметр           | Значение               |
      | Продуктовая группа | Потребительский кредит |
      | Статус             | Кредит выдан           |
    * в списке "Меню вкладок страницы" выбрать значение "Документы"
    * дождаться выполнения условий:
      | Объект   | Название                    | Состояние    |
      | страница | Кредитная заявка. Документы | отображается |
      | таблица  | Документы на кредит         | отображается |
    * нажать на кнопку "Печать анкеты-заявления (односторонняя)"
    * проверить документ "members.pdf" на соответствие эталону
      | Параметр       | Значение                       |
      | эталон         | ${Эталон анкеты}               |
      | инструкция     | ${Инструкция к шаблону анкеты} |
      | Номер договора | ${Номер заявки}                |
      | ИНН            | ${ИНН}                         |
      | Число          | ${Число}                       |
      | Месяца         | ${Месяца}                      |
      | Год            | ${Год}                         |

#
#    * дождаться выполнения условий:
#      | Объект | Название    | Состояние |
#      | файл   | members.pdf | загружен  |
#      | файл   | print.pdf   | загружен  |
#    * сохранить файл "members.pdf", как "${Анкета}.pdf"
#    * сохранить файл "print.pdf", как "${Приложение}.pdf"
#    * выполнить сценарий "Сравнить печатную форму с эталоном" с параметрами:
#      | Параметр        | Значение                       |
#      | Старый документ | ${Старая анкета}               |
#      | Файл            | ${Анкета}                      |
#      | Формат          | pdf                            |
#      | Инструкция      | ${Инструкция к шаблону анкеты} |

  @01.03
  Сценарий: 01.03 третий сценарий
    * открыть браузер
#    * открыть страницу "Просмотр ПДФ"
#    * сравнить печатную форму с эталоном
    * сформировать шаблон "Шаблон 1.txt" в соответствии с таблицей
      | Тип шаблонов                                               | Название фрагмента |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_1.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_2.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_3.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_4.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_5.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_6.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_7.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_8.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_9.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_10.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_11.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_12.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_13.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_14.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_15.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_16.txt        |
    * сформировать эталон по файлу "Анкета-заявление на предоставление кредита (односторонняя).pdf" и шаблону "Шаблон 1.txt"
      | Параметр       | Значение              |
      | Номер договора | 444/6300/931241000145 |
      | ИНН            | 178226687066          |
      | Число          | 07                    |
      | Месяца         | мая                   |
      | Год            | 2023                  |
    * сравнить файл "Анкета-заявление на предоставление кредита (односторонняя).pdf" с эталоном
