#language: ru
@001
@001.002

Функционал: [001. Анкета клиента][002. Создание]

  @001.002.001 @Smoke
  Сценарий: 001. Заполнение обязательных полей анкеты. Отказ от сохранения.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * в базе данных "esb-stub-db" выполнить sql-скрипт из файла "delete_client_by_name.sql" с параметрами:
      | Параметр | Значение             |
      | фамилия  | ${Клиент} -> фамилия |
      | имя      | ${Клиент} -> имя     |
    * дождаться отображения страницы "Поиск клиента"
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * дождаться отображения элемента "Уведомление"
    * служебный шаг: повторять действия до выполнения условий
    * нажать на кнопку "Новый клиент"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    | Ожидание |
      | страница | Создание клиента | отображается | 5 секунд |
    * нажать на кнопку "Полная идентификация"
    * заполнить поля формы в блоке "Общие сведения" значениями:
      | Тип          | Название                  | Значение                           |
      | поле         | Фамилия                   | ${Общие сведения} -> фамилия       |
      | поле         | Имя                       | ${Общие сведения} -> имя           |
      | поле         | Фамилия и Имя на латинице | ${Общие сведения} -> на латинице   |
      | дата         | Дата рождения             | ${Общие сведения} -> дата рождения |
      | радио-кнопка | Пол                       | ${Общие сведения} -> пол           |
      | справочник   | Гражданство               | ${Общие сведения} -> гражданство   |
    * заполнить поля формы в блоке "Место рождения" значениями:
      | Тип  | Название       | Значение                            |
      | поле | Место рождения | ${Место рождения} -> место рождения |
    * заполнить поля формы в блоке "Документы => Документ" значениями:
      | Тип  | Название          | Значение                        |
      | поле | Код подразделения | ${Паспорт} -> код подразделения |
      | поле | Кем выдан         | ${Паспорт} -> кем выдан         |
      | поле | Дата выдачи       | ${Паспорт} -> дата выдачи       |
    * примечание: далее работаем в контексте блока "Контакты"
    * ввести в поле "E-mail" значение "${Контакты} -> e-mail"
    * заполнить поля формы в блоке "Телефон" значениями:
      | Тип               | Название       | Значение                      |
      | выпадающий список | Тип телефона   | ${Контакты} -> тип телефона   |
      | поле              | Номер телефона | ${Контакты} -> номер телефона |
    * примечание: выходим из текущего контекста и работаем в контексте блока "Адреса"
    * в блоке "Адрес регистрации" нажать на поле "Адрес"
    * дождаться отображения страницы "Обратите внимание"
    * нажать на кнопку "Продолжить без верификации"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * заполнить поля формы в блоке "Адрес регистрации" значениями:
      | Тип               | Название               | Значение                                       |
      | справочник        | Страна                 | ${Адрес регистрации} -> страна                 |
      | поиск по значению | Адрес                  | ${Адрес регистрации} -> адрес                  |
      | поиск по значению | Регион                 | ${Адрес регистрации} -> регион                 |
      | поле              | Город                  | ${Адрес регистрации} -> город                  |
      | поле              | Улица                  | ${Адрес регистрации} -> улица                  |
      | поле              | Номер дома             | ${Адрес регистрации} -> номер дома             |
      | поле              | Индекс                 | ${Адрес регистрации} -> индекс                 |
      | дата              | Период регистрации (с) | ${Адрес регистрации} -> период регистрации (с) |
    * в блоке "Адрес фактического проживания" установить чекбокс "Совпадает с адресом регистрации"
    * в блоке "Почтовый адрес" установить чекбокс "Совпадает с адресом регистрации"
    * примечание: выходим из контекста блока "Адреса"
    * ввести в поле "Кодовое слово" значение "Автотест"
    * нажать на кнопку "Отмена"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Нет"
    * дождаться закрытия всплывающего окна "Обратите внимание"
    * служебный шаг: повторять действия до выполнения условий
    * нажать на кнопку "Отмена"
    * дождаться выполнения условий:
      | Объект           | Название          | Состояние    | Ожидание |
      | всплывающее окно | Обратите внимание | отображается | 5 секунд |
    * нажать на кнопку "Да"
    * дождаться отображения страницы "Поиск клиента"
    * заполнить поля формы значениями:
      | Тип  | Название | Значение                    |
      | поле | Серия    | ${Клиент} -> серия паспорта |
      | поле | Номер    | ${Клиент} -> номер паспорта |
    * нажать на кнопку "Найти"
    * дождаться отображения элемента "Уведомление"
    * служебный шаг: повторять действия до выполнения условий
    * нажать на кнопку "Новый клиент"
    * дождаться выполнения условий:
      | Объект   | Название         | Состояние    | Ожидание |
      | страница | Создание клиента | отображается | 5 секунд |
    * сделать снимок страницы

  @001.002.002
  Сценарий: 002. Заполнение обязательных полей анкеты. Сохранение.
    * определить значения тестовых параметров
    * в базе данных "esb-stub-db" выполнить sql-скрипт из файла "delete_client_by_name.sql" с параметрами:
      | Параметр | Значение             |
      | фамилия  | ${Клиент} -> фамилия |
      | имя      | ${Клиент} -> имя     |
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * выполнить сценарий "Открыть форму создания клиента"
    * выполнить сценарий "Заполнить обязательные поля анкеты с полной идентификацией"
    * нажать на кнопку "Сохранить"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Подтвердить"
    * дождаться отображения всплывающего окна "Карточка клиента успешно сохранена"
    * нажать на кнопку "Нет"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "ОК"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Нет"
    * дождаться отображения страницы "Продукты клиента"
    * сделать снимок страницы

  @01.02
  Сценарий: 01.02 Отладка сравнения печатных форм
    * определить значения тестовых параметров
    * войти в "ЕФР"
    * выполнить сценарий "Найти клиента"
    * в списке "Меню вкладок" выбрать "Данные клиента"
    * дождаться выполнения условий:
      | Объект   | Название       | Состояние    |
      | страница | Данные клиента | отображается |
    * сохранить значения поля "ИНН", как "ИНН"
    * выполнить сценарий "Открыть кредитную заявку" с параметрами:
      | Параметр           | Значение               |
      | Продуктовая группа | Потребительский кредит |
      | Статус             | Кредит выдан           |
    * в списке "Меню вкладок страницы" выбрать "Документы"
    * дождаться выполнения условий:
      | Объект   | Название                    | Состояние    |
      | страница | Кредитная заявка. Документы | отображается |
      | таблица  | Документы на кредит         | отображается |
    * нажать на кнопку "Печать анкеты-заявления (односторонняя)"
    * проверить документ "members.pdf" на соответствие эталону
      | Параметр       | Значение                       |
      | эталон         | ${Эталон анкеты}               |
      | инструкция     | ${Инструкция к шаблону анкеты} |
      | Номер договора | ${Номер заявки}                |
      | ИНН            | ${ИНН}                         |
      | Число          | ${Число}                       |
      | Месяца         | ${Месяца}                      |
      | Год            | ${Год}                         |

#
#    * дождаться выполнения условий:
#      | Объект | Название    | Состояние |
#      | файл   | members.pdf | загружен  |
#      | файл   | print.pdf   | загружен  |
#    * сохранить файл "members.pdf", как "${Анкета}.pdf"
#    * сохранить файл "print.pdf", как "${Приложение}.pdf"
#    * выполнить сценарий "Сравнить печатную форму с эталоном" с параметрами:
#      | Параметр        | Значение                       |
#      | Старый документ | ${Старая анкета}               |
#      | Файл            | ${Анкета}                      |
#      | Формат          | pdf                            |
#      | Инструкция      | ${Инструкция к шаблону анкеты} |

  @01.03
  Сценарий: 01.03 третий сценарий
    * открыть браузер
#    * открыть страницу "Просмотр ПДФ"
#    * сравнить печатную форму с эталоном
    * сформировать шаблон "Шаблон 1.txt" в соответствии с таблицей
      | Тип шаблонов                                               | Название фрагмента |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_1.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_2.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_3.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_4.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_5.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_6.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_7.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_8.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_9.txt         |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_10.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_11.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_12.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_13.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_14.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_15.txt        |
      | Анкета-заявление на предоставление кредита (односторонняя) | Page_16.txt        |
    * сформировать эталон по файлу "Анкета-заявление на предоставление кредита (односторонняя).pdf" и шаблону "Шаблон 1.txt"
      | Параметр       | Значение              |
      | Номер договора | 444/6300/931241000145 |
      | ИНН            | 178226687066          |
      | Число          | 07                    |
      | Месяца         | мая                   |
      | Год            | 2023                  |
    * сравнить файл "Анкета-заявление на предоставление кредита (односторонняя).pdf" с эталоном
