#language: ru
Функционал: Общий функционал

  Сценарий: Войти в ЕФР
    * открыть браузер
    * перейти по ссылке "${Адрес стартовой страницы}"
    * дождаться отображения страницы "Вход в ЕФР"
    * заполнить поля формы значениями:
      | Тип  | Название         | Значение                  |
      | поле | Имя пользователя | ${Пользователь} -> логин  |
      | поле | Пароль           | ${Пользователь} -> пароль |
    * нажать на кнопку "Войти"
    * дождаться отображения страницы "Поиск клиента"

  Сценарий: Найти клиента
    * заполнить поля формы значениями:
      | Тип  | Название | Значение          | Контроль          |
      | поле | Серия    | ${серия паспорта} | ${серия паспорта} |
      | поле | Номер    | ${номер паспорта} | ${номер паспорта} |
    * нажать на кнопку "Найти"
    * дождаться отображения страницы "Продукты клиента"

  Сценарий: Обновление страницы
    * обновить страницу