#language: ru
@000 @Smoke

Функционал: [000. Подготовка тестовых условий][004. Ожидание выполнения условий]

  @000.004.001
  Сценарий: 001. Название счета списания в переводах сменилось на 'Московский'
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * выполнить сценарий "Найти клиента" с параметрами:
      | Параметр       | Значение                    |
      | серия паспорта | ${Клиент} -> серия паспорта |
      | номер паспорта | ${Клиент} -> номер паспорта |
    * дождаться отображения блока "Карты"
    * примечание: далее работаем в контексте блока "Карты"
    * служебный шаг: повторять действия до выполнения условий "Найден карточный счет"
    * обновить страницу
    * в списке "Карточные счета" найти блок, соответствующий условиям:
      | Объект | Название    | Состояние | Значение                | Ожидание |
      | текст  | Номер счета | содержит  | 408 20 810 163000000070 | 1 минута |
    * в списке "Карты" найти блок, соответствующий условиям:
      | Объект | Название    | Состояние | Значение               |
      | текст  | Номер карты | содержит  | 55545 67** **** 545170 |
    * в меню "Операции" выбрать "Перевод между счетами клиента"
    * сформировать новую заявку по операции "Перевод между счетами клиента"
    * дождаться отображения всплывающего окна "Обратите внимание"
    * нажать на кнопку "Подтвердить"
    * дождаться отображения страницы "Подключение ДБО"
    * нажать на кнопку "Продолжить с бумажным подписанием"
    * дождаться выполнения условий "Счет списания не содержит 'Московский РФ'":
      | Объект            | Название                      | Состояние    | Значение      | Ожидание  |
      | страница          | Перевод между счетами клиента | отображается |               |           |
      | выпадающий список | Счет списания                 | не содержит  | Московский РФ | 1 секунда |
