#language: ru
@001
@001.002

Функционал: [001. Анкета клиента][002. Создание]

  @001.002.001 @Smoke
  Сценарий: 001. Заполнение обязательных полей анкеты. Отказ от сохранения.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * выполнить сценарий "Анкета клиента -> Удаление всех данных клиента в БД"
    * выполнить сценарий "Анкета клиента -> Открытие формы создания клиента"
    * выполнить сценарий "Анкета клиента -> Заполнение обязательных полей анкеты с полной идентификацией"
    * выполнить сценарий "Анкета клиента -> Отказ от сохранения изменений"
    * выполнить сценарий "Анкета клиента -> Открытие формы создания клиента"
    * сделать снимок страницы

  @001.002.002
  Сценарий: 002. Заполнение обязательных полей анкеты. Сохранение.
    * определить значения тестовых параметров
    * войти в "ЕФР" под учетными данными пользователя "Менеджер-операционист ТП"
    * выполнить сценарий "Анкета клиента -> Удаление всех данных клиента в БД"
    * выполнить сценарий "Анкета клиента -> Открытие формы создания клиента"
    * выполнить сценарий "Анкета клиента -> Заполнение обязательных полей анкеты с полной идентификацией"
    * выполнить сценарий "Анкета клиента -> Сохранение изменений"
    * сделать снимок страницы
